docs/index.org
# Created 2019-09-02 Mon 00:45
#+OPTIONS: num:nil
#+TITLE: Emacs config
#+AUTHOR: Daniel DeBruno (Renzix)
#+description: My org mode config file
#+language: en
#+export_file_name: ../docs/index.html

#+setupfile: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

#+property: header-args :results silent

Hello This is my second real attempt to make a "Perfect" config. Idk
if it will ever be good enough but here it is. Note this is available
on [[https://gitlab.com/Renzix/Dotfiles][gitlab]] and it should be mirrored on [[https://github.com/Renzix/Dotfiles-Mirror][github]]. There are multiple
versions of this file including [[file:index.html][readtheorg]], [[file:index.txt][plain text]] and [[file:index.md][markdown]]
for now.

Some decisions are inspired by

[[https://jamiecollinson.com/blog/my-emacs-config/][jamiecollinson]]: General layout \\
[[https://github.com/buffet/rice/blob/master/emacs/.emacs.d/config.org][Buffet]]: Random stuff and Actual help \\
[[https://github.com/hlissner/doom-emacs][Doom]]: Heavily Inspired keybindings and other stuff \\
[[https://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua]]: Random things and ideas \\
[[https://github.com/bbatsov/crux][Crux]]: Alot of my redefined functions are based off of it \\

#+begin_attention
Made to work with emacs 26 and 27 on windows, linux, and macos
#+end_attention

I automatically export my themes to my [[https:renzix.github.io/Dotfiles-Mirror][github pages]] docs directory on
save. This is not async because emacs sucks with async and it will
prompt me on open of file and of emacs. It definetly could be better
but it keeps my config/website up to date. This block is not tangled
so it only runs on save of the file. Maybe this will make me only save
when necessary.

#+name: export-to-docs
#+begin_src emacs-lisp
  (org-export-to-file 'html "../docs/index.html")
  (org-export-to-file 'org "../docs/index.org")
  (org-export-to-file 'ascii "../docs/index.txt")
  ;;(org-export-to-file 'latex "../docs/index.pdf") ;; Make this work especially async???@TODO(Renzix)
#+end_src

* Plans

Some things I plan on doing or trying out.
- Let init.el byte compile file
- Add more language support
- Add macros to my config so i dont have to use use-package some
  include.
  - [ ] [[pkg!]] Defines a package which you can use! or cfg!. You can
    either pass in a named repo or a git repo. Also maybe what minor modes and more
  - [ ] [[use!]]  This package only loads when a specific requirement
    is met ie major mode
  - [ ] [[cfg!]] evaluates a list before and after the package is
    loaded. Only runs if use! has been defined.
  - [ ] [[key!]] defines a key depending on state and optionally map. Only runs
    if use! has been defined and runs after cfg is loaded.
  - [ ] [[ex!]] defines a ex command (just a alias basically)

* Startup

Starts up emacs. This should be somewhat small and only for
proccesses that are required to run first. Also there is a small [[https://stackoverflow.com/questions/57153556/why-does-emacs-fail-to-install-gnu-elpa-keyring-update-and-some-other-package][bug]]
which is annoying.

** Enable local variable check

I disable the check for safety in [[file:init.el][init.el]] so that I dont have to
press y/n on startup. I would like to be somewhat safe and eval
code at the top so I reactivate the check here.

#+name: enable-local-eval
#+begin_src emacs-lisp
  (setq enable-local-eval 'maybe
        enable-local-variables t)
#+end_src

