docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-02 Mon 00:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs config</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel DeBruno (Renzix)" />
<meta name="description" content="My org mode config file"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs config</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfac48fe">Plans</a></li>
<li><a href="#org0967daf">Startup</a>
<ul>
<li><a href="#org85c1b5d">Enable local variable check</a></li>
<li><a href="#orgb9f4307">Configure package sources</a></li>
<li><a href="#orgd8161bf">Bootstrap use-package</a></li>
<li><a href="#org54ba831">quelpa</a></li>
<li><a href="#orge67d535">Increase garbage collector threshold</a></li>
<li><a href="#org87815f6">Set custom settings to load in own file</a></li>
<li><a href="#org21623c2">Package Macros</a>
<ul>
<li><a href="#orgf050b80"><span class="todo TODO">TODO</span> pkg!</a></li>
<li><a href="#org8764ee7"><span class="todo TODO">TODO</span> use!</a></li>
<li><a href="#org159fe49"><span class="todo TODO">TODO</span> cfg!</a></li>
<li><a href="#orgc91239d"><span class="todo TODO">TODO</span> key!</a></li>
<li><a href="#orgd7e6d7e"><span class="todo TODO">TODO</span> ex!</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0078061">Preferences</a>
<ul>
<li><a href="#orgc931d23"><span class="todo SOMEDAY">SOMEDAY</span> Buffers</a></li>
<li><a href="#orgf9a85d3">Display</a></li>
<li><a href="#org50fb077">Other</a></li>
<li><a href="#orgc69d8b8">Useful Functions</a>
<ul>
<li><a href="#orgd261165">Edit Text</a></li>
<li><a href="#org756f1b7">Format Text</a></li>
<li><a href="#orgbefac8d">File Handling</a></li>
<li><a href="#org48423a6"><span class="todo SOMEDAY">SOMEDAY</span> Projects</a></li>
<li><a href="#org4c6cf50"><span class="todo SOMEDAY">SOMEDAY</span> Open Buffer</a></li>
<li><a href="#org66e06bc"><span class="todo SOMEDAY">SOMEDAY</span> Eval</a></li>
<li><a href="#org45b8251">Redefined Functions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org526891e">Core</a>
<ul>
<li><a href="#orgc64e50e">Key Packages</a>
<ul>
<li><a href="#orgb599d69">evil</a></li>
<li><a href="#org3f9b75c">god mode</a></li>
<li><a href="#org1cbd6fa">general</a></li>
<li><a href="#orgee21590">key-chord</a></li>
<li><a href="#org3d414c4">avy</a></li>
</ul>
</li>
<li><a href="#orgc367dee">Fuzzy Find</a>
<ul>
<li><a href="#org9635113">helm</a></li>
<li><a href="#org86d4949"><span class="todo SOMEDAY">SOMEDAY</span> ido</a></li>
<li><a href="#org182a7c4"><span class="todo SOMEDAY">SOMEDAY</span> ivy</a></li>
</ul>
</li>
<li><a href="#orge154d8a">Version Control</a>
<ul>
<li><a href="#org2578ea4">Git</a></li>
<li><a href="#org4c0f4a1"><span class="todo SOMEDAY">SOMEDAY</span> vcmode</a></li>
</ul>
</li>
<li><a href="#org19ae2d4">Autocompletion</a>
<ul>
<li><a href="#org0115e0d">Company</a></li>
</ul>
</li>
<li><a href="#org2203df7">Projects</a>
<ul>
<li><a href="#orga62588f">projectile</a></li>
<li><a href="#orgb583094">treemacs</a></li>
</ul>
</li>
<li><a href="#orgb1c01ab">Plain Text Modes</a>
<ul>
<li><a href="#org4e94f31">Org</a></li>
<li><a href="#orgc1f6ccf">LaTeX</a></li>
<li><a href="#org025fba3">Markdown</a></li>
</ul>
</li>
<li><a href="#org9ca8741">Terminals</a>
<ul>
<li><a href="#org5bd43f0">vterm</a></li>
<li><a href="#org7675069">eshell</a></li>
</ul>
</li>
<li><a href="#orgd9fcabc">Templates/Snippets</a>
<ul>
<li><a href="#orgd54fbc0">Gentoo Snippets</a></li>
</ul>
</li>
<li><a href="#org16f7749">Chat programs</a>
<ul>
<li><a href="#orgf218843">Matrix</a></li>
<li><a href="#org2abb36c">Discord</a></li>
<li><a href="#org369e4aa">IRC</a></li>
</ul>
</li>
<li><a href="#org7738301">Visual Helpers</a>
<ul>
<li><a href="#org1d761cb">beacon</a></li>
<li><a href="#org31d5907">rainbow-delimiters</a></li>
<li><a href="#org46b31a5"><span class="todo TODO">TODO</span> wilfred</a></li>
<li><a href="#org72c045c">which-key</a></li>
</ul>
</li>
<li><a href="#org21c3ace">Should Be in Emacs</a>
<ul>
<li><a href="#org75a3475">expand-region</a></li>
</ul>
</li>
<li><a href="#orgc179e37">Programming</a>
<ul>
<li><a href="#org06d904b">smartparens</a></li>
<li><a href="#orgf7578ea">LSP</a></li>
<li><a href="#org8530695">JVM</a></li>
<li><a href="#orgde109f3">Scripting langs</a></li>
<li><a href="#org1cc2d7e">lisps</a></li>
<li><a href="#org88a9588">Microsoft/Dotnet</a></li>
<li><a href="#orgb77e1b5">rust</a></li>
<li><a href="#org2e205b8">c and cpp</a></li>
<li><a href="#orgc8febeb">haskell</a></li>
<li><a href="#orgaa19064">Google</a></li>
<li><a href="#orge438f2b">Flycheck</a></li>
<li><a href="#orgaa006a0">imenu</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org26db8fd">Keybindings</a>
<ul>
<li><a href="#orga546eef">Rant on keybindings</a></li>
<li><a href="#org8c75b5f">Emacs State</a></li>
<li><a href="#orgad86bb8">Normal/Visual State</a></li>
<li><a href="#org3e17438">Insert State</a></li>
<li><a href="#org0bf0531">Ex commands</a></li>
<li><a href="#org9d9940a">Major Modes</a>
<ul>
<li><a href="#org56fc106">Plain Text</a></li>
<li><a href="#org5a8d960">Programming</a></li>
<li><a href="#org7d6a87d">Messaging</a></li>
<li><a href="#orgd9a6789">Other</a></li>
</ul>
</li>
<li><a href="#org992447d">Other</a>
<ul>
<li><a href="#org99cf1fa">Helm</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Hello This is my second real attempt to make a "Perfect" config. Idk
if it will ever be good enough but here it is. Note this is available
on <a href="https://gitlab.com/Renzix/Dotfiles">gitlab</a> and it should be mirrored on <a href="https://github.com/Renzix/Dotfiles-Mirror">github</a>. There are multiple
versions of this file including <a href="index.html">readtheorg</a>, <a href="index.txt">plain text</a> and <a href="index.md">markdown</a>
for now.
</p>

<p>
Some decisions are inspired by
</p>

<p>
<a href="https://jamiecollinson.com/blog/my-emacs-config/">jamiecollinson</a>: General layout <br />
<a href="https://github.com/buffet/rice/blob/master/emacs/.emacs.d/config.org">Buffet</a>: Random stuff and Actual help <br />
<a href="https://github.com/hlissner/doom-emacs">Doom</a>: Heavily Inspired keybindings and other stuff <br />
<a href="https://pages.sachachua.com/.emacs.d/Sacha.html">Sacha Chua</a>: Random things and ideas <br />
<a href="https://github.com/bbatsov/crux">Crux</a>: Alot of my redefined functions are based off of it <br />
</p>

<div class="attention">
<p>
Made to work with emacs 26 and 27 on windows, linux, and macos
</p>

</div>

<p>
I automatically export my themes to my <a href="https:renzix.github.io/Dotfiles-Mirror">github pages</a> docs directory on
save. This is not async because emacs sucks with async and it will
prompt me on open of file and of emacs. It definetly could be better
but it keeps my config/website up to date. This block is not tangled
so it only runs on save of the file. Maybe this will make me only save
when necessary.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfc84af6"><span style="color: #80A0C2;">(</span>org-export-to-file 'html <span style="color: #A2BF8A;">"../docs/index.html"</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>org-export-to-file 'org <span style="color: #A2BF8A;">"../docs/index.org"</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>org-export-to-file 'ascii <span style="color: #A2BF8A;">"../docs/index.txt"</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;;</span><span style="color: #747474;">(org-export-to-file 'latex "../docs/index.pdf") ;; Make this work especially async???@</span><span style="color: #cc9393;">TODO</span><span style="color: #747474;">(Renzix)</span>
</pre>
</div>

<div id="outline-container-orgfac48fe" class="outline-2">
<h2 id="orgfac48fe">Plans</h2>
<div class="outline-text-2" id="text-orgfac48fe">
<p>
Some things I plan on doing or trying out.
</p>
<ul class="org-ul">
<li>Let init.el byte compile file</li>
<li>Add more language support</li>
<li>Add macros to my config so i dont have to use use-package some
include.
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="#org45e6a3f">1</a> Defines a package which you can use! or cfg!. You can
either pass in a named repo or a git repo. Also maybe what minor modes and more</li>
<li class="off"><code>[&#xa0;]</code> <a href="#org8764ee7">use!</a>  This package only loads when a specific requirement
is met ie major mode</li>
<li class="off"><code>[&#xa0;]</code> <a href="#org159fe49">cfg!</a> evaluates a list before and after the package is
loaded. Only runs if use! has been defined.</li>
<li class="off"><code>[&#xa0;]</code> <a href="#orgc91239d">key!</a> defines a key depending on state and optionally map. Only runs
if use! has been defined and runs after cfg is loaded.</li>
<li class="off"><code>[&#xa0;]</code> <a href="#orgd7e6d7e">ex!</a> defines a ex command (just a alias basically)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0967daf" class="outline-2">
<h2 id="org0967daf">Startup</h2>
<div class="outline-text-2" id="text-org0967daf">
<p>
Starts up emacs. This should be somewhat small and only for
proccesses that are required to run first. Also there is a small <a href="https://stackoverflow.com/questions/57153556/why-does-emacs-fail-to-install-gnu-elpa-keyring-update-and-some-other-package">bug</a>
which is annoying.
</p>
</div>

<div id="outline-container-org85c1b5d" class="outline-3">
<h3 id="org85c1b5d">Enable local variable check</h3>
<div class="outline-text-3" id="text-org85c1b5d">
<p>
I disable the check for safety in <a href="init.el">init.el</a> so that I dont have to
press y/n on startup. I would like to be somewhat safe and eval
code at the top so I reactivate the check here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org853bfa1"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> enable-local-eval 'maybe
      enable-local-variables t<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
