docs/index.org
** Configure package sources

Melpa is nice because its more bleeding edge. Elpa is the general
GNU repo which everyone should probably have anyway.

#+name: melpa
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
  (setq package-archives
        '(("elpa"     . "https://elpa.gnu.org/packages/")
          ("melpa"        . "https://melpa.org/packages/"))
        package-archive-priorities
        '(("elpa"     . 5) ("melpa"        . 10)))
  ;; bug in macos
  (when (string= system-type "darwin")
    (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3"))
#+end_src

** Bootstrap use-package

install =use-package= if not already installed.

#+name: use-package
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package)
  (require 'use-package-ensure)
#+end_src

Makes sure that =use-package= always downloads the package if not available

#+begin_src emacs-lisp
  (setq use-package-always-ensure t)
#+end_src
** quelpa

Quelpa is another way to get packages and it basically wraps around
git repositories. Its really nice if you want bleeding edge stuff
and also it has a [[use-package]] with the keyword :quelpa.

#+name: quelpa-use-package
#+begin_src emacs-lisp
  (use-package quelpa
    :init (setq quelpa-upgrade-p t))
  (use-package quelpa-use-package) 
#+end_src
** Increase garbage collector threshold

The default garbage collection threshold is 800kB, increasing this
to 10MB for startup increases speed.

#+name: garbage-collection
#+begin_src emacs-lisp
  (setq gc-cons-threshold 10000000)

  ;; Restore after startup
  (add-hook 'after-init-hook
            (lambda ()
              (setq gc-cons-threshold 1000000)
              (message "gc-cons-threshold restored to %S"
                       gc-cons-threshold)))
#+end_src

** Set custom settings to load in own file

This stops emacs adding customised settings to =init.el=. I try to
avoid using customize anyway, preferring programmatic control of
variables. Creating it as a temporary file effectively disables it
(i.e. any changes are session local).

#+name: custom
#+begin_src emacs-lisp
  (setq custom-file (make-temp-file "emacs-custom"))
#+end_src

** Package Macros

These are my package macros which I will be using to download and
install packages. Preferably these will be as lazy loaded as
possible.

*** TODO pkg!

This defines a package which you can use! or cfg!. Ideally
disabling this doesnt actually load the package but tells you
where to find it. Doesnt load while im still testing it.

#+name: pkg!
#+begin_src emacs-lisp
  (defvar pkg!-list nil)
  (setq pkg!-list nil)

  (defun pkg! (&rest rest) ;; @TODO(Renzix:
    "Defines the packages and save it as NAME and LOC.  LOC is the
    location.  This accepts a unlimited amount of params throught REST"
    (setq rest (seq-partition rest 2))
    (cl-loop for x in rest do
             (let ((name (car x))
                   (loc (car (cdr x))))
               (message "name: %s loc: %s" name loc)
               ;; Check if LOC is a defined repo if not then check if it is a
               ;; website (for git) if not then assume its a github user/reponame
               (cond ((string= loc "Melpa")
                      (add-to-list 'pkg!-list `(,name ,loc)))
                     (t (error-message-string (format "Location %s for %s not implemented" loc name)))))
             (setq rest (cdr rest))))
  (pkg! "use-package" "Melpa" "ree" "Melpa")
  (message "%s" pkg!-list)
#+end_src

*** TODO use!

First looks to see if the package is defined with pkg!. If it is
then define when you want to run the load code with a function
which returns true. Also define when that code will be checked ie
what hook. After all that run cfg! if it is defined.

