docs/index.html

<div id="outline-container-orgb9f4307" class="outline-3">
<h3 id="orgb9f4307">Configure package sources</h3>
<div class="outline-text-3" id="text-orgb9f4307">
<p>
Melpa is nice because its more bleeding edge. Elpa is the general
GNU repo which everyone should probably have anyway.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf296115"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> package-enable-at-startup nil<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> package-archives
      '<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"elpa"</span>     . <span style="color: #A2BF8A;">"https://elpa.gnu.org/packages/"</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"melpa"</span>        . <span style="color: #A2BF8A;">"https://melpa.org/packages/"</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
      package-archive-priorities
      '<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"elpa"</span>     . 5<span style="color: #A2BF8A;">)</span> <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"melpa"</span>        . 10<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;; </span><span style="color: #747474;">bug in macos</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #B58DAE;">(</span>string= system-type <span style="color: #A2BF8A;">"darwin"</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> gnutls-algorithm-priority <span style="color: #A2BF8A;">"NORMAL:-VERS-TLS1.3"</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8161bf" class="outline-3">
<h3 id="orgd8161bf">Bootstrap use-package</h3>
<div class="outline-text-3" id="text-orgd8161bf">
<p>
install <code>use-package</code> if not already installed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org979d6a8"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">unless</span> <span style="color: #B58DAE;">(</span>package-installed-p 'use-package<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>package-refresh-contents<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>package-install 'use-package<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">use-package</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">use-package-ensure</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Makes sure that <code>use-package</code> always downloads the package if not available
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> use-package-always-ensure t<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org54ba831" class="outline-3">
<h3 id="org54ba831">quelpa</h3>
<div class="outline-text-3" id="text-org54ba831">
<p>
Quelpa is another way to get packages and it basically wraps around
git repositories. Its really nice if you want bleeding edge stuff
and also it has a <a href="#org979d6a8">1</a> with the keyword :quelpa.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf78dab0"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">quelpa</span>
  <span style="color: #8EBCBB;">:init</span> <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> quelpa-upgrade-p t<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">quelpa-use-package</span><span style="color: #80A0C2;">)</span> 
</pre>
</div>
</div>
</div>
<div id="outline-container-orge67d535" class="outline-3">
<h3 id="orge67d535">Increase garbage collector threshold</h3>
<div class="outline-text-3" id="text-orge67d535">
<p>
The default garbage collection threshold is 800kB, increasing this
to 10MB for startup increases speed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga83e96d"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> gc-cons-threshold 10000000<span style="color: #80A0C2;">)</span>

<span style="color: #747474;">;; </span><span style="color: #747474;">Restore after startup</span>
<span style="color: #80A0C2;">(</span>add-hook 'after-init-hook
          <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #A2BF8A;">()</span>
            <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">setq</span> gc-cons-threshold 1000000<span style="color: #A2BF8A;">)</span>
            <span style="color: #A2BF8A;">(</span>message <span style="color: #A2BF8A;">"gc-cons-threshold restored to %S"</span>
                     gc-cons-threshold<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org87815f6" class="outline-3">
<h3 id="org87815f6">Set custom settings to load in own file</h3>
<div class="outline-text-3" id="text-org87815f6">
<p>
This stops emacs adding customised settings to <code>init.el</code>. I try to
avoid using customize anyway, preferring programmatic control of
variables. Creating it as a temporary file effectively disables it
(i.e. any changes are session local).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc16280c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> custom-file <span style="color: #B58DAE;">(</span>make-temp-file <span style="color: #A2BF8A;">"emacs-custom"</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org21623c2" class="outline-3">
<h3 id="org21623c2">Package Macros</h3>
<div class="outline-text-3" id="text-org21623c2">
<p>
These are my package macros which I will be using to download and
install packages. Preferably these will be as lazy loaded as
possible.
</p>
</div>

<div id="outline-container-orgf050b80" class="outline-4">
<h4 id="orgf050b80"><span class="todo TODO">TODO</span> pkg!</h4>
<div class="outline-text-4" id="text-orgf050b80">
<p>
This defines a package which you can use! or cfg!. Ideally
disabling this doesnt actually load the package but tells you
where to find it. Doesnt load while im still testing it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org45e6a3f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defvar</span> <span style="color: #dac6d6;">pkg!-list</span> nil<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> pkg!-list nil<span style="color: #80A0C2;">)</span>

<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">pkg!</span> <span style="color: #B58DAE;">(</span><span style="color: #ECCC87;">&amp;rest</span> rest<span style="color: #B58DAE;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">@</span><span style="color: #cc9393;">TODO</span><span style="color: #747474;">(Renzix:</span>
  <span style="color: #7d7d7d;">"Defines the packages and save it as NAME and LOC.  LOC is the</span>
<span style="color: #7d7d7d;">  location.  This accepts a unlimited amount of params throught REST"</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> rest <span style="color: #A2BF8A;">(</span>seq-partition rest 2<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">cl-loop</span> for x in rest do
           <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #D2876D;">(</span><span style="color: #5D80AE;">(</span>name <span style="color: #ECCC87;">(</span>car x<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
                 <span style="color: #5D80AE;">(</span>loc <span style="color: #ECCC87;">(</span>car <span style="color: #8EBCBB;">(</span>cdr x<span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
             <span style="color: #D2876D;">(</span>message <span style="color: #A2BF8A;">"name: %s loc: %s"</span> name loc<span style="color: #D2876D;">)</span>
             <span style="color: #747474;">;; </span><span style="color: #747474;">Check if LOC is a defined repo if not then check if it is a</span>
             <span style="color: #747474;">;; </span><span style="color: #747474;">website (for git) if not then assume its a github user/reponame</span>
             <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">cond</span> <span style="color: #5D80AE;">(</span><span style="color: #ECCC87;">(</span>string= loc <span style="color: #A2BF8A;">"Melpa"</span><span style="color: #ECCC87;">)</span>
                    <span style="color: #ECCC87;">(</span>add-to-list 'pkg!-list `<span style="color: #8EBCBB;">(</span>,name ,loc<span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
                   <span style="color: #5D80AE;">(</span>t <span style="color: #ECCC87;">(</span>error-message-string <span style="color: #8EBCBB;">(</span>format <span style="color: #A2BF8A;">"Location %s for %s not implemented"</span> loc name<span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
           <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">setq</span> rest <span style="color: #D2876D;">(</span>cdr rest<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>pkg! <span style="color: #A2BF8A;">"use-package"</span> <span style="color: #A2BF8A;">"Melpa"</span> <span style="color: #A2BF8A;">"ree"</span> <span style="color: #A2BF8A;">"Melpa"</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>message <span style="color: #A2BF8A;">"%s"</span> pkg!-list<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8764ee7" class="outline-4">
<h4 id="org8764ee7"><span class="todo TODO">TODO</span> use!</h4>
<div class="outline-text-4" id="text-org8764ee7">
<p>
First looks to see if the package is defined with pkg!. If it is
then define when you want to run the load code with a function
which returns true. Also define when that code will be checked ie
what hook. After all that run cfg! if it is defined.
</p>
</div>
</div>
