docs/index.org
*** TODO cfg!

define 2 lists which will get evaluated. The first list will be
evaluated before the package is loaded. the second list will be
ran after the package is loaded.


*** TODO key!
*** TODO ex!
* Preferences

Some preferences I like/dont like about emacs. Basically trying to
make the defaults better.

** SOMEDAY Buffers

- Note taken on [2019-08-18 Sun 21:53]  \\
  Make it so this only triggers on laptop? Also add a section for my variables.

Dont display startscreen on startup. I used to use eshell but now
that I have ss as a keybinding I don't think its nessisary.

#+name: initial-buffer
#+begin_src emacs-lisp
  (setq inhibit-startup-screen t
        initial-buffer-choice nil)
#+end_src

Buffers dont ask for confirmation when killed while doing a
job. Makes things much easier/simpler and when I close one i know
im closing it.

#+name: confirm-kill-processes
#+begin_src emacs-lisp
  (setq confirm-kill-processes nil)
#+end_src

Nice little display for my battery.

#+name: battery
#+begin_src emacs-lisp
  (display-battery-mode)
#+end_src

