docs/index.html

<div id="outline-container-org159fe49" class="outline-4">
<h4 id="org159fe49"><span class="todo TODO">TODO</span> cfg!</h4>
<div class="outline-text-4" id="text-org159fe49">
<p>
define 2 lists which will get evaluated. The first list will be
evaluated before the package is loaded. the second list will be
ran after the package is loaded.
</p>
</div>
</div>


<div id="outline-container-orgc91239d" class="outline-4">
<h4 id="orgc91239d"><span class="todo TODO">TODO</span> key!</h4>
</div>
<div id="outline-container-orgd7e6d7e" class="outline-4">
<h4 id="orgd7e6d7e"><span class="todo TODO">TODO</span> ex!</h4>
</div>
</div>
</div>
<div id="outline-container-org0078061" class="outline-2">
<h2 id="org0078061">Preferences</h2>
<div class="outline-text-2" id="text-org0078061">
<p>
Some preferences I like/dont like about emacs. Basically trying to
make the defaults better.
</p>
</div>

<div id="outline-container-orgc931d23" class="outline-3">
<h3 id="orgc931d23"><span class="todo SOMEDAY">SOMEDAY</span> Buffers</h3>
<div class="outline-text-3" id="text-orgc931d23">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-08-18 Sun 21:53] </span></span> <br />
Make it so this only triggers on laptop? Also add a section for my variables.</li>
</ul>

<p>
Dont display startscreen on startup. I used to use eshell but now
that I have ss as a keybinding I don't think its nessisary.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgdb254a2"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> inhibit-startup-screen t
      initial-buffer-choice nil<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Buffers dont ask for confirmation when killed while doing a
job. Makes things much easier/simpler and when I close one i know
im closing it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org980afdb"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> confirm-kill-processes nil<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Nice little display for my battery.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgcd72044"><span style="color: #80A0C2;">(</span>display-battery-mode<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
