docs/index.org
** Display

Some things that nobody ever should enable. Ever. menu-bar,
tool-bar and scroll-bar all require a mouse so they suck.

#+name: bar-disable
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

Disables more then 2 windows spawning as this makes magit alot more
annoying and in general only 2 windows are nessisary.

#+name: two-windows
#+begin_src emacs-lisp
  (setq split-width-threshold (- (window-width) 10))
  (setq split-height-threshold nil)
  (defun count-visible-buffers (&optional frame)
    "Count how many buffers are currently being shown.  Defaults to selected FRAME."
    (length (mapcar #'window-buffer (window-list frame))))
  (defun do-not-split-more-than-two-windows (window &optional horizontal)
    "WINDOW HORIZONTAL."
    (if (and horizontal (> (count-visible-buffers) 1))
        nil
      t))
  (advice-add 'window-splittable-p :before-while #'do-not-split-more-than-two-windows)
#+end_src

In evil relative line numbers are really nice. This also allows the
current line number to not be 0 but whatever the actual line number
it is. Having 0 is kinda useless in relative line numbers. This is
disabled for [[vterm]] because it doesnt deal with it well.

#+name: line-numbers
#+begin_src emacs-lisp
  (when (>= emacs-major-version 26)
    (global-display-line-numbers-mode)
    (setq-default display-line-numbers-type 'relative
                  display-line-numbers-current-absolute t
                  display-line-numbers-width 3
                  display-line-numbers-widen t))
#+end_src

There are alot of good themes out there and having a single theme
is boring so I make it switch depending on the day of the
week. Also the theme stays default if emacs is ran in the terminal
because the themes that are good suck in the terminal and black is
good enough. There is a bug with monokai on macos and windows where
it loads without me telling it to. Because of this i have to
enable/disable it...

#+name: theme
#+begin_src emacs-lisp
  (when (display-graphic-p)
    (defvar renzix-weekday (format-time-string "%w"))
    (use-package doom-themes)
    (use-package apropospriate-theme)
    (use-package monokai-theme
      :config 
      (load-theme 'monokai t)
      (disable-theme 'monokai))
    (cond ((string= "0" renzix-weekday) ;; Sunday
           (load-theme 'doom-dracula t))
          ((string= "1" renzix-weekday) ;; Monday
           (load-theme 'doom-opera t))
          ((string= "2" renzix-weekday) ;; Tuesday
           (load-theme 'apropospriate-dark t))
          ((string= "3" renzix-weekday) ;; Wednesday
           (load-theme 'doom-molokai t))
          ((string= "4" renzix-weekday) ;; Thursday
           (load-theme 'doom-nord t))
          ((string= "5" renzix-weekday) ;; Friday
           (load-theme 'monokai t))
          ((string= "6" renzix-weekday) ;; Saturday
           (load-theme 'doom-one t))))
#+end_src

Evil is cool and i want to be able to tell what state I am in
without having to look at the bottom left. One easy way to do this
is change the color and type of the cursor. It changes the type but
not the color by default and normal is the same as emacs
state. However because i have god-mode It does not come with a easy
way of doing this so i have a function to update it.

#+name: evil-cursor
#+begin_src emacs-lisp
  (setq evil-insert-state-cursor '(bar "#ff00ff")
        evil-normal-state-cursor '(box "#6666f6")
        evil-motion-state-cursor '(hollow "#87d7ff")
        evil-replace-state-cursor '(hollow "#bf2222")
        evil-operator-state-cursor '(box "#F5F5DC")
        evil-visual-state-cursor '(hollow "#ffffff")
        evil-emacs-state-cursor '(hbar "#43DE43"))
  (setq-default cursor-type 'hbar)
  (set-cursor-color "#43DE43")
  (defun my/update-god-cursor (&rest args)
    "Update the cursor from god-mode."
    (cond 
     ((eq god-local-mode t) ;; if i just do god-local-mode it thinks its a function
      (set-cursor-color "#FFFF00")
      (setq cursor-type 'box))
     ((eq evil-state 'emacs)
      (set-cursor-color "#43DE43")
      (setq cursor-type 'hbar))))
#+end_src

Beeing able to see matching parens is nice so lets enable
parens-mode. I could only enable this for specific modes but i
think this is extremely useful always.

#+name: show-paren-mode
#+begin_src emacs-lisp
  (show-paren-mode 1)
#+end_src

TODO and other stuff should have a different color so lets enable
that. Also there is a feature of emacs to highlight the current
line so lets also enable that.

#+name: highlight
#+begin_src emacs-lisp
  (global-hl-todo-mode)
  (global-hl-line-mode)
#+end_src

