docs/index.html

<div id="outline-container-orgf9a85d3" class="outline-3">
<h3 id="orgf9a85d3">Display</h3>
<div class="outline-text-3" id="text-orgf9a85d3">
<p>
Some things that nobody ever should enable. Ever. menu-bar,
tool-bar and scroll-bar all require a mouse so they suck.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org774beb9"><span style="color: #80A0C2;">(</span>menu-bar-mode -1<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>tool-bar-mode -1<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>scroll-bar-mode -1<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Disables more then 2 windows spawning as this makes magit alot more
annoying and in general only 2 windows are nessisary.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org65bc13b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> split-width-threshold <span style="color: #B58DAE;">(</span>- <span style="color: #A2BF8A;">(</span>window-width<span style="color: #A2BF8A;">)</span> 10<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> split-height-threshold nil<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">count-visible-buffers</span> <span style="color: #B58DAE;">(</span><span style="color: #ECCC87;">&amp;optional</span> frame<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Count how many buffers are currently being shown.  Defaults to selected FRAME."</span>
  <span style="color: #B58DAE;">(</span>length <span style="color: #A2BF8A;">(</span>mapcar #'window-buffer <span style="color: #D2876D;">(</span>window-list frame<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">do-not-split-more-than-two-windows</span> <span style="color: #B58DAE;">(</span>window <span style="color: #ECCC87;">&amp;optional</span> horizontal<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"WINDOW HORIZONTAL."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">and</span> horizontal <span style="color: #D2876D;">(</span>&gt; <span style="color: #5D80AE;">(</span>count-visible-buffers<span style="color: #5D80AE;">)</span> 1<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
      nil
    t<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>advice-add 'window-splittable-p <span style="color: #8EBCBB;">:before-while</span> #'do-not-split-more-than-two-windows<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
In evil relative line numbers are really nice. This also allows the
current line number to not be 0 but whatever the actual line number
it is. Having 0 is kinda useless in relative line numbers. This is
disabled for <a href="#org6b014ac">1</a> because it doesnt deal with it well.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4d3d1ca"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #B58DAE;">(</span>&gt;= emacs-major-version 26<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>global-display-line-numbers-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq-default</span> display-line-numbers-type 'relative
                display-line-numbers-current-absolute t
                display-line-numbers-width 3
                display-line-numbers-widen t<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
There are alot of good themes out there and having a single theme
is boring so I make it switch depending on the day of the
week. Also the theme stays default if emacs is ran in the terminal
because the themes that are good suck in the terminal and black is
good enough. There is a bug with monokai on macos and windows where
it loads without me telling it to. Because of this i have to
enable/disable it&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgab1d61a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #B58DAE;">(</span>display-graphic-p<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">defvar</span> <span style="color: #dac6d6;">renzix-weekday</span> <span style="color: #A2BF8A;">(</span>format-time-string <span style="color: #A2BF8A;">"%w"</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">doom-themes</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">apropospriate-theme</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">monokai-theme</span>
    <span style="color: #8EBCBB;">:config</span> 
    <span style="color: #A2BF8A;">(</span>load-theme 'monokai t<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>disable-theme 'monokai<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">cond</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"0"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Sunday</span>
         <span style="color: #D2876D;">(</span>load-theme 'doom-dracula t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"1"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Monday</span>
         <span style="color: #D2876D;">(</span>load-theme 'doom-opera t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"2"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Tuesday</span>
         <span style="color: #D2876D;">(</span>load-theme 'apropospriate-dark t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"3"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Wednesday</span>
         <span style="color: #D2876D;">(</span>load-theme 'doom-molokai t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"4"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Thursday</span>
         <span style="color: #D2876D;">(</span>load-theme 'doom-nord t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"5"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Friday</span>
         <span style="color: #D2876D;">(</span>load-theme 'monokai t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>string= <span style="color: #A2BF8A;">"6"</span> renzix-weekday<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">Saturday</span>
         <span style="color: #D2876D;">(</span>load-theme 'doom-one t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Evil is cool and i want to be able to tell what state I am in
without having to look at the bottom left. One easy way to do this
is change the color and type of the cursor. It changes the type but
not the color by default and normal is the same as emacs
state. However because i have god-mode It does not come with a easy
way of doing this so i have a function to update it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5334d2f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> evil-insert-state-cursor '<span style="color: #B58DAE;">(</span>bar <span style="color: #A2BF8A;">"#ff00ff"</span><span style="color: #B58DAE;">)</span>
      evil-normal-state-cursor '<span style="color: #B58DAE;">(</span>box <span style="color: #A2BF8A;">"#6666f6"</span><span style="color: #B58DAE;">)</span>
      evil-motion-state-cursor '<span style="color: #B58DAE;">(</span>hollow <span style="color: #A2BF8A;">"#87d7ff"</span><span style="color: #B58DAE;">)</span>
      evil-replace-state-cursor '<span style="color: #B58DAE;">(</span>hollow <span style="color: #A2BF8A;">"#bf2222"</span><span style="color: #B58DAE;">)</span>
      evil-operator-state-cursor '<span style="color: #B58DAE;">(</span>box <span style="color: #A2BF8A;">"#F5F5DC"</span><span style="color: #B58DAE;">)</span>
      evil-visual-state-cursor '<span style="color: #B58DAE;">(</span>hollow <span style="color: #A2BF8A;">"#ffffff"</span><span style="color: #B58DAE;">)</span>
      evil-emacs-state-cursor '<span style="color: #B58DAE;">(</span>hbar <span style="color: #A2BF8A;">"#43DE43"</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq-default</span> cursor-type 'hbar<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>set-cursor-color <span style="color: #A2BF8A;">"#43DE43"</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/update-god-cursor</span> <span style="color: #B58DAE;">(</span><span style="color: #ECCC87;">&amp;rest</span> args<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Update the cursor from god-mode."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">cond</span> 
   <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>eq god-local-mode t<span style="color: #D2876D;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">if i just do god-local-mode it thinks its a function</span>
    <span style="color: #D2876D;">(</span>set-cursor-color <span style="color: #A2BF8A;">"#FFFF00"</span><span style="color: #D2876D;">)</span>
    <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">setq</span> cursor-type 'box<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
   <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>eq evil-state 'emacs<span style="color: #D2876D;">)</span>
    <span style="color: #D2876D;">(</span>set-cursor-color <span style="color: #A2BF8A;">"#43DE43"</span><span style="color: #D2876D;">)</span>
    <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">setq</span> cursor-type 'hbar<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Beeing able to see matching parens is nice so lets enable
parens-mode. I could only enable this for specific modes but i
think this is extremely useful always.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1e3592f"><span style="color: #80A0C2;">(</span>show-paren-mode 1<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
TODO and other stuff should have a different color so lets enable
that. Also there is a feature of emacs to highlight the current
line so lets also enable that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org65b82a2"><span style="color: #80A0C2;">(</span>global-hl-todo-mode<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>global-hl-line-mode<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
