docs/index.org
** Other

By default symlinks should always be followed. Makes it much easier
to deal with dynamic stuff like my config. Instead of asking me if
I want to follow it.

#+name: symlinks
#+begin_src emacs-lisp
  (setq vc-follow-symlinks t)
#+end_src

Typing yes or no is hard and y or n is easier so lets do that
instead.

#+name: yes-or-no-p
#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

Use spaces instead of tabs by default. Either is fine to me however
I have to choose one and only one.

#+name: indent-default
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

Emacs backups are kinda weird by default as they apear in the same
directory as the file. Also the tilda is kinda weird syntax so I
make it a single folder and have lots of backups as I dont need the
space.

#+name: backups
#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . "~/.saves"))
        backup-by-copying t
        delete-old-versions t
        kept-new-versions 10
        kept-old-versions 10
        version-control t)
#+end_src

Sometimes i enable this because warnings r annoying

#+name: warn-level
#+begin_src emacs-lisp
  (setq warning-minimum-level :error)
#+end_src

If you set the variable kill-whole-line then the kill-line will
delete the entire line including newline if at the beginning of the
line.

#+name: kill-whole-line
#+begin_src emacs-lisp
  (setq kill-whole-line t)
#+end_src

Use utf-8 when you can

#+name: prefer-coding-system
#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
#+end_src

** Useful Functions
*** Edit Text

Made specifically for insert state but works in other
states. Deletes backwards until a space. Not a true vim word or
WORD.

#+name: evil-insert-delete-back-word
#+begin_src emacs-lisp
  (defun my/evil-insert-delete-back-word ()
    "Made specifically for insert state but works in other
  states. Deletes backwards until a space. Not a true vim word or
  WORD."
    (interactive)
    (delete-region
     (point)
     (save-excursion (skip-syntax-backward "^ ") (point))))
#+end_src

This is in vim but not in evil. Reverts any changes that were made
on the current line in insert mode.

#+name: evil-insert-undo-line
#+begin_src emacs-lisp
  (defun my/evil-insert-undo-line ()
    "Undo a line in insert mode."
    (interactive)
    (if (looking-back "^" 0)
        (backward-delete-char 1)
      (if (looking-back "^\s*" 0)
          (delete-region (point) (line-beginning-position))
        (evil-delete
         (+ (line-beginning-position) (current-indentation)) (point)))))
#+end_src

*** Format Text

#+name: indent-buffer
#+begin_src emacs-lisp
  (defun my/smart-indent ()
    "If a region is selected indent that.
  If given ARG indent the current line.
  Else indent the entire buffer."
    (interactive)
    (save-excursion
      (if (region-active-p) (progn
                              (indent-region (region-beginning) (region-end))
                              (message "Indenting region")))
      (if current-prefix-arg
          (progn
            (indent-region (line-beginning-position) (line-end-position))
            (message "Indenting line"))
        (progn
          (indent-region (point-min) (point-max))
          (message "Identing buffer")))))
#+end_src

Smart indentation that i found [[https://www.emacswiki.org/emacs/NoTabs][here]]. Infers indentation based on
the amount of tabs/spaces in the current buffer. If its a new
buffer then use the [[indent-default][default value]].

#+name: infer-identation-style
#+begin_src emacs-lisp
  (defun my/infer-indentation-style ()
    (let ((space-count (how-many "^  " (point-min) (point-max)))
          (tab-count (how-many "^\t" (point-min) (point-max))))
      (if (> space-count tab-count) (setq indent-tabs-mode nil))
      (if (> tab-count space-count) (setq indent-tabs-mode t))))
#+end_src

