docs/index.html

<div id="outline-container-org50fb077" class="outline-3">
<h3 id="org50fb077">Other</h3>
<div class="outline-text-3" id="text-org50fb077">
<p>
By default symlinks should always be followed. Makes it much easier
to deal with dynamic stuff like my config. Instead of asking me if
I want to follow it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org77b983c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> vc-follow-symlinks t<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Typing yes or no is hard and y or n is easier so lets do that
instead.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc820dc4"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defalias</span> '<span style="color: #8EBCBB;">yes-or-no-p</span> 'y-or-n-p<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Use spaces instead of tabs by default. Either is fine to me however
I have to choose one and only one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org016f479"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq-default</span> indent-tabs-mode nil<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Emacs backups are kinda weird by default as they apear in the same
directory as the file. Also the tilda is kinda weird syntax so I
make it a single folder and have lots of backups as I dont need the
space.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf36e5c2"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> backup-directory-alist `<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"."</span> . <span style="color: #A2BF8A;">"~/.saves"</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
      backup-by-copying t
      delete-old-versions t
      kept-new-versions 10
      kept-old-versions 10
      version-control t<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Sometimes i enable this because warnings r annoying
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd6bd14b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> warning-minimum-level <span style="color: #8EBCBB;">:error</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
If you set the variable kill-whole-line then the kill-line will
delete the entire line including newline if at the beginning of the
line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga399807"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> kill-whole-line t<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Use utf-8 when you can
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6c5bfc1"><span style="color: #80A0C2;">(</span>prefer-coding-system 'utf-8<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc69d8b8" class="outline-3">
<h3 id="orgc69d8b8">Useful Functions</h3>
<div class="outline-text-3" id="text-orgc69d8b8">
</div>
<div id="outline-container-orgd261165" class="outline-4">
<h4 id="orgd261165">Edit Text</h4>
<div class="outline-text-4" id="text-orgd261165">
<p>
Made specifically for insert state but works in other
states. Deletes backwards until a space. Not a true vim word or
WORD.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4d184a2"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/evil-insert-delete-back-word</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Made specifically for insert state but works in other</span>
<span style="color: #7d7d7d;">states. Deletes backwards until a space. Not a true vim word or</span>
<span style="color: #7d7d7d;">WORD."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>delete-region
   <span style="color: #A2BF8A;">(</span>point<span style="color: #A2BF8A;">)</span>
   <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">save-excursion</span> <span style="color: #D2876D;">(</span>skip-syntax-backward <span style="color: #A2BF8A;">"^ "</span><span style="color: #D2876D;">)</span> <span style="color: #D2876D;">(</span>point<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This is in vim but not in evil. Reverts any changes that were made
on the current line in insert mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc978765"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/evil-insert-undo-line</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Undo a line in insert mode."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>looking-back <span style="color: #A2BF8A;">"^"</span> 0<span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>backward-delete-char 1<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>looking-back <span style="color: #A2BF8A;">"^\s*"</span> 0<span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>delete-region <span style="color: #5D80AE;">(</span>point<span style="color: #5D80AE;">)</span> <span style="color: #5D80AE;">(</span>line-beginning-position<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>evil-delete
       <span style="color: #5D80AE;">(</span>+ <span style="color: #ECCC87;">(</span>line-beginning-position<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>current-indentation<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span> <span style="color: #5D80AE;">(</span>point<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org756f1b7" class="outline-4">
<h4 id="org756f1b7">Format Text</h4>
<div class="outline-text-4" id="text-org756f1b7">
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd9dc481"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/smart-indent</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"If a region is selected indent that.</span>
<span style="color: #7d7d7d;">If given ARG indent the current line.</span>
<span style="color: #7d7d7d;">Else indent the entire buffer."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">save-excursion</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>region-active-p<span style="color: #D2876D;">)</span> <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">progn</span>
                            <span style="color: #5D80AE;">(</span>indent-region <span style="color: #ECCC87;">(</span>region-beginning<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>region-end<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
                            <span style="color: #5D80AE;">(</span>message <span style="color: #A2BF8A;">"Indenting region"</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> current-prefix-arg
        <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">progn</span>
          <span style="color: #5D80AE;">(</span>indent-region <span style="color: #ECCC87;">(</span>line-beginning-position<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>line-end-position<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
          <span style="color: #5D80AE;">(</span>message <span style="color: #A2BF8A;">"Indenting line"</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">progn</span>
        <span style="color: #5D80AE;">(</span>indent-region <span style="color: #ECCC87;">(</span>point-min<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>point-max<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
        <span style="color: #5D80AE;">(</span>message <span style="color: #A2BF8A;">"Identing buffer"</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Smart indentation that i found <a href="https://www.emacswiki.org/emacs/NoTabs">here</a>. Infers indentation based on
the amount of tabs/spaces in the current buffer. If its a new
buffer then use the <a href="#org016f479">default value</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org99b5c66"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/infer-indentation-style</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>space-count <span style="color: #5D80AE;">(</span>how-many <span style="color: #A2BF8A;">"^  "</span> <span style="color: #ECCC87;">(</span>point-min<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>point-max<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>tab-count <span style="color: #5D80AE;">(</span>how-many <span style="color: #A2BF8A;">"^\t"</span> <span style="color: #ECCC87;">(</span>point-min<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>point-max<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>&gt; space-count tab-count<span style="color: #D2876D;">)</span> <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">setq</span> indent-tabs-mode nil<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>&gt; tab-count space-count<span style="color: #D2876D;">)</span> <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">setq</span> indent-tabs-mode t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
