docs/index.org
*** File Handling

Emacs is actually stupid and if you try to rename a open file it
wont effect the buffer. You then end up with 2 files and you have
to either close or rename the buffer. This should be in emacs by
default idk why its not.

#+name: rename-file-and-buffer
#+begin_src emacs-lisp
  (defun my/rename-file-and-buffer ()
    "Renames current buffer and file it is visiting."
    (interactive)
    (let* ((name (buffer-name))
           (filename (buffer-file-name))
           (basename (file-name-nondirectory filename)))
      (if (not (and filename (file-exists-p filename)))
          (error "Buffer '%s' is not visiting a file!" name)
        (let ((new-name (read-file-name "New name: "
                                        (file-name-directory filename) basename nil basename)))
          (if (get-buffer new-name)
              (error "A buffer named '%s' already exists!" new-name)
            (rename-file filename new-name 1)
            (rename-buffer new-name)
            (set-visited-file-name new-name)
            (set-buffer-modified-p nil)
            (message "File '%s' successfully renamed to '%s'"
                     name (file-name-nondirectory new-name)))))))
#+end_src

This is the same problem as the function above. Emacs does not
close the buffer you have open if you delete the file so you might
accidently save it. Better to just call this function if the buffer
is open.

#+name: delete-file-and-buffer
#+begin_src emacs-lisp
  (defun delete-file-and-buffer ()
    "Kill the current buffer and deletes the file it is visiting."
    (interactive)
    (let ((filename (buffer-file-name)))
      (when filename
        (if (vc-backend filename)
            (vc-delete-file filename)
          (progn
            (delete-file filename)
            (message "Deleted file %s" filename)
            (kill-buffer))))))
#+end_src

Reads a string directly from a file then returns it as a string

#+name: get-string-from-file
#+begin_src emacs-lisp
  (defun my/get-string-from-file (filePath)
    "Return filePath's file content."
    (with-temp-buffer
      (insert-file-contents filePath)
      (buffer-string)))
#+end_src

