docs/index.html

<div id="outline-container-orgbefac8d" class="outline-4">
<h4 id="orgbefac8d">File Handling</h4>
<div class="outline-text-4" id="text-orgbefac8d">
<p>
Emacs is actually stupid and if you try to rename a open file it
wont effect the buffer. You then end up with 2 files and you have
to either close or rename the buffer. This should be in emacs by
default idk why its not.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org50e7de5"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/rename-file-and-buffer</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Renames current buffer and file it is visiting."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">let*</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>name <span style="color: #5D80AE;">(</span>buffer-name<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
         <span style="color: #D2876D;">(</span>filename <span style="color: #5D80AE;">(</span>buffer-file-name<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
         <span style="color: #D2876D;">(</span>basename <span style="color: #5D80AE;">(</span>file-name-nondirectory filename<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>not <span style="color: #5D80AE;">(</span><span style="color: #80A0C2;">and</span> filename <span style="color: #ECCC87;">(</span>file-exists-p filename<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span><span style="color: #ECCC87;">error</span> <span style="color: #A2BF8A;">"Buffer '%s' is not visiting a file!"</span> name<span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #5D80AE;">(</span><span style="color: #ECCC87;">(</span>new-name <span style="color: #8EBCBB;">(</span>read-file-name <span style="color: #A2BF8A;">"New name: "</span>
                                      <span style="color: #a2b6da;">(</span>file-name-directory filename<span style="color: #a2b6da;">)</span> basename nil basename<span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
        <span style="color: #5D80AE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #ECCC87;">(</span>get-buffer new-name<span style="color: #ECCC87;">)</span>
            <span style="color: #ECCC87;">(</span><span style="color: #ECCC87;">error</span> <span style="color: #A2BF8A;">"A buffer named '%s' already exists!"</span> new-name<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>rename-file filename new-name 1<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>rename-buffer new-name<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>set-visited-file-name new-name<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>set-buffer-modified-p nil<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>message <span style="color: #A2BF8A;">"File '%s' successfully renamed to '%s'"</span>
                   name <span style="color: #8EBCBB;">(</span>file-name-nondirectory new-name<span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This is the same problem as the function above. Emacs does not
close the buffer you have open if you delete the file so you might
accidently save it. Better to just call this function if the buffer
is open.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5c2482c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">delete-file-and-buffer</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Kill the current buffer and deletes the file it is visiting."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>filename <span style="color: #5D80AE;">(</span>buffer-file-name<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">when</span> filename
      <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #5D80AE;">(</span>vc-backend filename<span style="color: #5D80AE;">)</span>
          <span style="color: #5D80AE;">(</span>vc-delete-file filename<span style="color: #5D80AE;">)</span>
        <span style="color: #5D80AE;">(</span><span style="color: #80A0C2;">progn</span>
          <span style="color: #ECCC87;">(</span>delete-file filename<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>message <span style="color: #A2BF8A;">"Deleted file %s"</span> filename<span style="color: #ECCC87;">)</span>
          <span style="color: #ECCC87;">(</span>kill-buffer<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Reads a string directly from a file then returns it as a string
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8c6f1ca"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/get-string-from-file</span> <span style="color: #B58DAE;">(</span>filePath<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Return filePath's file content."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">with-temp-buffer</span>
    <span style="color: #A2BF8A;">(</span>insert-file-contents filePath<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>buffer-string<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
