docs/index.org
*** SOMEDAY Projects

- Note taken on [2019-08-18 Sun 21:53]  \\
  Make a =projectile-create-tags= that also works on windows

This first sees if it is in a projectile project. If it isnt then
it will ask for one then run =projectile-find-file=. If it is then
it will just run =projectile-find-file=. Just a better default.

#+name: helm-projectile-find-file-or-project
#+begin_src emacs-lisp
  (defun my/helm-projectile-find-file-or-project ()
    "Does switch project if not in a project and 'find-file' if in one."
    (interactive)
    (if (projectile-project-p)
        (helm-projectile-find-file)
      (helm-projectile-switch-project)))
#+end_src

This one runs =helm-projectile-find-file= if in a project but
normal =helm-find-file= if not inside a project.

#+name: helm-projectile-find-file-or-find-file
#+begin_src emacs-lisp
  (defun my/helm-projectile-find-file-or-find-file ()
    "Does switch project if not in a project and 'find-file' if in one."
    (interactive)
    (if (projectile-project-p)
        (helm-projectile-find-file)
      (helm-find-files nil)))
#+end_src

This first sees if it is in a projectile project. If it isnt then
it will ask for one then both of them run =helm-projectile-ag= or
=helm-projectile-rg= depending on if you are in windows or
something else. I made this fix because helm-projectile-rg didnt
work on windows but maybe i should try again later (rg does work
on windows just not the emacs plugin).

#+name: helm-projectile-search-or-project
#+begin_src emacs-lisp
  (defun my/helm-projectile-search-or-project ()
    "Does switch project if not in a project and search all files in said project."
    (interactive)
    (if (projectile-project-p)
        (if (string-equal system-type "windows-nt")
            (helm-projectile-ag)
          (helm-projectile-rg))
      (helm-projectile-switch-project)))
#+end_src

Creates tags for all the files. I need to get something like this
that works properly on windows.

#+name: create-tags
#+begin_src emacs-lisp
  (defun my/create-tags (dir-name)
    "Create tags file in DIR-NAME."
    (interactive "DDirectory: ")
    (eshell-command
     (format "find %s -type f -name \"*.[ch]\" | etags -" dir-name)))
#+end_src

