docs/index.html

<div id="outline-container-org48423a6" class="outline-4">
<h4 id="org48423a6"><span class="todo SOMEDAY">SOMEDAY</span> Projects</h4>
<div class="outline-text-4" id="text-org48423a6">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-08-18 Sun 21:53] </span></span> <br />
Make a <code>projectile-create-tags</code> that also works on windows</li>
</ul>

<p>
This first sees if it is in a projectile project. If it isnt then
it will ask for one then run <code>projectile-find-file</code>. If it is then
it will just run <code>projectile-find-file</code>. Just a better default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2b4640f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-projectile-find-file-or-project</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Does switch project if not in a project and 'find-file' if in one."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>projectile-project-p<span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>helm-projectile-find-file<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>helm-projectile-switch-project<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This one runs <code>helm-projectile-find-file</code> if in a project but
normal <code>helm-find-file</code> if not inside a project.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org26780e1"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-projectile-find-file-or-find-file</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Does switch project if not in a project and 'find-file' if in one."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>projectile-project-p<span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>helm-projectile-find-file<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>helm-find-files nil<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This first sees if it is in a projectile project. If it isnt then
it will ask for one then both of them run <code>helm-projectile-ag</code> or
<code>helm-projectile-rg</code> depending on if you are in windows or
something else. I made this fix because helm-projectile-rg didnt
work on windows but maybe i should try again later (rg does work
on windows just not the emacs plugin).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org67adc4b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-projectile-search-or-project</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Does switch project if not in a project and search all files in said project."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>projectile-project-p<span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>string-equal system-type <span style="color: #A2BF8A;">"windows-nt"</span><span style="color: #D2876D;">)</span>
          <span style="color: #D2876D;">(</span>helm-projectile-ag<span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>helm-projectile-rg<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>helm-projectile-switch-project<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Creates tags for all the files. I need to get something like this
that works properly on windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org49cf3e3"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/create-tags</span> <span style="color: #B58DAE;">(</span>dir-name<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Create tags file in DIR-NAME."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span> <span style="color: #A2BF8A;">"DDirectory: "</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>eshell-command
   <span style="color: #A2BF8A;">(</span>format <span style="color: #A2BF8A;">"find %s -type f -name \"*.[ch]\" | etags -"</span> dir-name<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
