docs/index.org
*** SOMEDAY Open Buffer

- Note taken on [2019-08-18 Sun 21:54]  \\
  Add doas-edit or make [[sudo-edit]] check for bsd/doas

I like using eshell and vterm but dealing with emacs buffers is
actually insane. I made a coupld simple functions to switch to a
vterm/eshell window and then be able to switch back. This makes
them fullscreen which is hella nice. This is the variable that
stores the perspective.

#+name: my:window-conf
#+begin_src emacs-lisp
  (defvar my/window-conf nil)
#+end_src

Here is the eshell toggle function which uses said variable to
switch if not already in a eshell buffer fullscreen.

#+name: eshell-toggle
#+begin_src emacs-lisp
  (defun my/eshell-toggle (buf-name)
    "Switch to eshell and save persp.  BUF-NAME is the current buffer name."
    (interactive (list (buffer-name)))
    (if (string-equal buf-name "*eshell*")
        (set-window-configuration my/window-conf)
      (progn
        (setq my/window-conf (current-window-configuration))
        (delete-other-windows)
        (eshell))))
#+end_src

This is for the next funciton. vterm doesnt automatically switch
if called and open so i need a helper function.

#+name: switch-to-vterm
#+begin_src emacs-lisp
  (defun my/switch-to-vterm ()
    "Switch to vterm."
    (if (get-buffer "vterm")
        (switch-to-buffer "vterm")
      (vterm)))
#+end_src

Function to switch to a fullscreen terminal and back again without
losing your current layout.

#+name: vterm-toggle
#+begin_src emacs-lisp
  (defun my/vterm-toggle (buf-name)
    "Switch to vterm and save persp.  BUF-NAME is the current buffer name."
    (interactive (list (buffer-name)))
    (if (string-equal buf-name "vterm")
        (set-window-configuration my:window-conf)
      (progn
        (setq my:window-conf (current-window-configuration))
        (delete-other-windows)
        (switch-to-vterm))))
#+end_src

Opens magit status in a single buffer because its so much easier to
work with a do git things. I dont really need to see the file I was
working on as I can just see the changes in =magit-status=

#+name: magit-status-only
#+begin_src emacs-lisp
  (defun my/magit-status-only ()
    "Opens magit-status in a single buffer."
    (magit-status)
    (delete-other-windows))
#+end_src

Opens the current buffer with sudo. Again this probably should be
default or at least some form of it as this doesnt work if you dont
have sudo. Maybe there is a cross platform su thing for tramp? idk

#+name: sudo-edit
#+begin_src emacs-lisp
  (defun my/sudo-edit (&optional arg)
    "Edits a file with sudo priv.  Optionally take a ARG for the filename."
    (interactive "P")
    (if (or arg (not buffer-file-name))
        (find-file
         (concat "/sudo:root@localhost:"
                 (ido-read-file-name "Find file(as root): ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
#+end_src

Opens my emacs configuration for editing.

#+name: open-emacs-config
#+begin_src emacs-lisp
  (defun my/open-emacs-config ()
    "Opens my Emacs config uwu."
    (interactive)
    (find-file "~/Dotfiles/.emacs.d/config.org"))
#+end_src

