docs/index.html

<div id="outline-container-org4c6cf50" class="outline-4">
<h4 id="org4c6cf50"><span class="todo SOMEDAY">SOMEDAY</span> Open Buffer</h4>
<div class="outline-text-4" id="text-org4c6cf50">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-08-18 Sun 21:54] </span></span> <br />
Add doas-edit or make <a href="#orgda84bab">1</a> check for bsd/doas</li>
</ul>

<p>
I like using eshell and vterm but dealing with emacs buffers is
actually insane. I made a coupld simple functions to switch to a
vterm/eshell window and then be able to switch back. This makes
them fullscreen which is hella nice. This is the variable that
stores the perspective.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org402c66c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defvar</span> <span style="color: #dac6d6;">my/window-conf</span> nil<span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Here is the eshell toggle function which uses said variable to
switch if not already in a eshell buffer fullscreen.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga91372f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/eshell-toggle</span> <span style="color: #B58DAE;">(</span>buf-name<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Switch to eshell and save persp.  BUF-NAME is the current buffer name."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span> <span style="color: #A2BF8A;">(</span>list <span style="color: #D2876D;">(</span>buffer-name<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>string-equal buf-name <span style="color: #A2BF8A;">"*eshell*"</span><span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>set-window-configuration my/window-conf<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">progn</span>
      <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">setq</span> my/window-conf <span style="color: #5D80AE;">(</span>current-window-configuration<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>delete-other-windows<span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>eshell<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This is for the next funciton. vterm doesnt automatically switch
if called and open so i need a helper function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org42293e0"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/switch-to-vterm</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Switch to vterm."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>get-buffer <span style="color: #A2BF8A;">"vterm"</span><span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>switch-to-buffer <span style="color: #A2BF8A;">"vterm"</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>vterm<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Function to switch to a fullscreen terminal and back again without
losing your current layout.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgbb17194"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/vterm-toggle</span> <span style="color: #B58DAE;">(</span>buf-name<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Switch to vterm and save persp.  BUF-NAME is the current buffer name."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span> <span style="color: #A2BF8A;">(</span>list <span style="color: #D2876D;">(</span>buffer-name<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span>string-equal buf-name <span style="color: #A2BF8A;">"vterm"</span><span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>set-window-configuration my:window-conf<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">progn</span>
      <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">setq</span> my:window-conf <span style="color: #5D80AE;">(</span>current-window-configuration<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>delete-other-windows<span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>switch-to-vterm<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Opens magit status in a single buffer because its so much easier to
work with a do git things. I dont really need to see the file I was
working on as I can just see the changes in <code>magit-status</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org32fbb05"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/magit-status-only</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Opens magit-status in a single buffer."</span>
  <span style="color: #B58DAE;">(</span>magit-status<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>delete-other-windows<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Opens the current buffer with sudo. Again this probably should be
default or at least some form of it as this doesnt work if you dont
have sudo. Maybe there is a cross platform su thing for tramp? idk
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgda84bab"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/sudo-edit</span> <span style="color: #B58DAE;">(</span><span style="color: #ECCC87;">&amp;optional</span> arg<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Edits a file with sudo priv.  Optionally take a ARG for the filename."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span> <span style="color: #A2BF8A;">"P"</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">or</span> arg <span style="color: #D2876D;">(</span>not buffer-file-name<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
      <span style="color: #A2BF8A;">(</span>find-file
       <span style="color: #D2876D;">(</span>concat <span style="color: #A2BF8A;">"/sudo:root@localhost:"</span>
               <span style="color: #5D80AE;">(</span>ido-read-file-name <span style="color: #A2BF8A;">"Find file(as root): "</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>find-alternate-file <span style="color: #D2876D;">(</span>concat <span style="color: #A2BF8A;">"/sudo:root@localhost:"</span> buffer-file-name<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Opens my emacs configuration for editing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb0a4b4a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/open-emacs-config</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"Opens my Emacs config uwu."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>find-file <span style="color: #A2BF8A;">"~/Dotfiles/.emacs.d/config.org"</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
