docs/index.org
*** SOMEDAY Eval

Helper function for smart-eval. Says if its valid lisp or not.
Functions that help you do evalution of functions and deal with
stuff.

#+name: valid-elisp-p :tangle no
#+begin_src emacs-lisp
  (defun my/valid-elisp-p (s)
    "S is a string."
    (and (listp (read s))
         (not (booleanp (read s)))))
#+end_src

@TODO(renzix): Finish this

#+name: smart-eval
#+begin_src emacs-lisp
  (defun my/smart-eval ()
    "This function interactively evaluates elisp.  First it checks
              to see if there is anything in the kill-ring that is valid elisp."
    (interactive)
    (let ((kr (if (current-kill 0 t) (current-kill 0 t) nil))
          (values nil))
      (cond 
       ;; ((use-region-p) (setq values (eval (buffer-substring start ion-end)))))
       ((valid-elisp-p kr) (setq values `(,(eval (read kr)))))
       ((t) (call-interactively 'eval-expression)))
      (message "%s" (car values))
      (kill-new (prin1-to-string (car values)))))
#+end_src

*** Redefined Functions

This is C-a redefined to go to first nonwhitespace then if pressed
again go to actual start of line. Stolen from [[https://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][here]] and from [[https://github.com/bbatsov/crux][crux]].

#+name: move-beginning-of-line
#+begin_src emacs-lisp
  (defun my/move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (move-beginning-of-line 1)
      (when (= orig-point (point))
        (back-to-indentation))))
#+end_src

This is a function close to evil o and O which is pretty useful in
alot of scenerios. I have 0 idea why this isnt in emacs already. This
was also mainly stolen from [[https://emacsredux.com/blog/2013/03/26/smarter-open-line/][this]] and [[https://emacsredux.com/blog/2013/06/15/open-line-above/][this]] which was based off of [[https://github.com/bbatsov/crux][crux]] emacs
extension.

#+name: smart-open-line
#+begin_src emacs-lisp
  (defun my/smart-open-line (arg)
    "Insert an empty line after the current line.
  Position the cursor at its beginning, according to the current mode."
    (interactive "P")
    (if arg
        (progn
          (move-beginning-of-line nil)
          (newline-and-indent)
          (forward-line -1)
          (indent-according-to-mode))
      (progn
        (move-end-of-line nil)
        (newline-and-indent))))
#+end_src

* Core
** Key Packages
