docs/index.html

<div id="outline-container-org66e06bc" class="outline-4">
<h4 id="org66e06bc"><span class="todo SOMEDAY">SOMEDAY</span> Eval</h4>
<div class="outline-text-4" id="text-org66e06bc">
<p>
Helper function for smart-eval. Says if its valid lisp or not.
Functions that help you do evalution of functions and deal with
stuff.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0731f67"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/valid-elisp-p</span> <span style="color: #B58DAE;">(</span>s<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"S is a string."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">and</span> <span style="color: #A2BF8A;">(</span>listp <span style="color: #D2876D;">(</span>read s<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
       <span style="color: #A2BF8A;">(</span>not <span style="color: #D2876D;">(</span>booleanp <span style="color: #5D80AE;">(</span>read s<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
@TODO(renzix): Finish this
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc03ead3"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/smart-eval</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #7d7d7d;">"This function interactively evaluates elisp.  First it checks</span>
<span style="color: #7d7d7d;">            to see if there is anything in the kill-ring that is valid elisp."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>kr <span style="color: #5D80AE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #ECCC87;">(</span>current-kill 0 t<span style="color: #ECCC87;">)</span> <span style="color: #ECCC87;">(</span>current-kill 0 t<span style="color: #ECCC87;">)</span> nil<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>values nil<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">cond</span> 
     <span style="color: #747474;">;; </span><span style="color: #747474;">((use-region-p) (setq values (eval (buffer-substring start ion-end)))))</span>
     <span style="color: #D2876D;">(</span><span style="color: #5D80AE;">(</span>valid-elisp-p kr<span style="color: #5D80AE;">)</span> <span style="color: #5D80AE;">(</span><span style="color: #80A0C2;">setq</span> values `<span style="color: #ECCC87;">(</span>,<span style="color: #8EBCBB;">(</span>eval <span style="color: #a2b6da;">(</span>read kr<span style="color: #a2b6da;">)</span><span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span><span style="color: #5D80AE;">(</span>t<span style="color: #5D80AE;">)</span> <span style="color: #5D80AE;">(</span>call-interactively 'eval-expression<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>message <span style="color: #A2BF8A;">"%s"</span> <span style="color: #D2876D;">(</span>car values<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>kill-new <span style="color: #D2876D;">(</span>prin1-to-string <span style="color: #5D80AE;">(</span>car values<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org45b8251" class="outline-4">
<h4 id="org45b8251">Redefined Functions</h4>
<div class="outline-text-4" id="text-org45b8251">
<p>
This is C-a redefined to go to first nonwhitespace then if pressed
again go to actual start of line. Stolen from <a href="https://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/">here</a> and from <a href="https://github.com/bbatsov/crux">crux</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd5e5e5e"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/move-beginning-of-line</span> <span style="color: #B58DAE;">(</span>arg<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Move point back to indentation of beginning of line.</span>

<span style="color: #7d7d7d;">Move point to the first non-whitespace character on this line.</span>
<span style="color: #7d7d7d;">If point is already there, move to the beginning of the line.</span>
<span style="color: #7d7d7d;">Effectively toggle between the first non-whitespace character and</span>
<span style="color: #7d7d7d;">the beginning of the line.</span>

<span style="color: #7d7d7d;">If ARG is not nil or 1, move forward ARG - 1 lines first.  If</span>
<span style="color: #7d7d7d;">point reaches the beginning or end of the buffer, stop there."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span> <span style="color: #A2BF8A;">"^p"</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> arg <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">or</span> arg 1<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>

  <span style="color: #747474;">;; </span><span style="color: #747474;">Move lines first</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #A2BF8A;">(</span>/= arg 1<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #D2876D;">(</span><span style="color: #5D80AE;">(</span>line-move-visual nil<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>forward-line <span style="color: #5D80AE;">(</span>1- arg<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>

  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>orig-point <span style="color: #5D80AE;">(</span>point<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>move-beginning-of-line 1<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #D2876D;">(</span>= orig-point <span style="color: #5D80AE;">(</span>point<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>back-to-indentation<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This is a function close to evil o and O which is pretty useful in
alot of scenerios. I have 0 idea why this isnt in emacs already. This
was also mainly stolen from <a href="https://emacsredux.com/blog/2013/03/26/smarter-open-line/">this</a> and <a href="https://emacsredux.com/blog/2013/06/15/open-line-above/">this</a> which was based off of <a href="https://github.com/bbatsov/crux">crux</a> emacs
extension.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6834265"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/smart-open-line</span> <span style="color: #B58DAE;">(</span>arg<span style="color: #B58DAE;">)</span>
  <span style="color: #7d7d7d;">"Insert an empty line after the current line.</span>
<span style="color: #7d7d7d;">Position the cursor at its beginning, according to the current mode."</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span> <span style="color: #A2BF8A;">"P"</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> arg
      <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">progn</span>
        <span style="color: #D2876D;">(</span>move-beginning-of-line nil<span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>newline-and-indent<span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>forward-line -1<span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>indent-according-to-mode<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">progn</span>
      <span style="color: #D2876D;">(</span>move-end-of-line nil<span style="color: #D2876D;">)</span>
      <span style="color: #D2876D;">(</span>newline-and-indent<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
