docs/index.org
*** evil

Evil is vi emulation in emacs. It is by far the best vi emulation
outside of vi itself and very extendable/fast.

#+name: evil
#+begin_src emacs-lisp
  (use-package evil
    :config 
    (setq evil-default-state 'emacs) ;; For now this will always be emacs state so i get used to it
    (evil-mode 1))
#+end_src

=evil-collection= is a project which provides evil keybindings for
almost every popular plugin in emacs outside of a few. Its really
nice if you want to use evil in buffers where its very emacsy. A
list of all keybindings and supported packages can be found
[[https://github.com/emacs-evil/evil-collection][here]]. One of the nonsupported packages is magit so here is
[[file:config.org::*evil-magit][evil-magit]] config. Also [[evil-magit]] has to load before evil so it
needs to set evil-want-keybinding to nil.

#+name: evil-collection
#+begin_src emacs-lisp
  (use-package evil-collection
    :after '(evil evil-magit)
    :config (evil-collection-init))
#+end_src

=evil-goggles= makes it so that every edit you do is highlighted
for a brief period of time. This makes it much easier to know
exactly what you are doing and also looks cool af.

#+name: evil-goggles
#+begin_src emacs-lisp
  (use-package evil-goggles
    :after evil
    :config (progn
              (evil-goggles-mode)
              (evil-goggles-use-diff-faces)))
#+end_src

=evil-matchit= makes % work for alot of different things. All of
them are listed [[https://github.com/redguardtoo/evil-matchit][here]].

#+name: evil-matchit
#+begin_src emacs-lisp
  (use-package evil-matchit
    :after evil
    :config (global-evil-matchit-mode 1))
#+end_src

*** god mode

God mode is a way to bring a prefix like style of keybinds to
emacs. It allows you to press a prefix key then all your keybinds
are like holding Control. In order to "let go" of the control you
press spacebar first. In order to use alt instead do a g prefix. A
G prefix its the same as Control and Alt. Color wise I have it use
a yellow box and a green underscore for normal emacs mode. There
is no good way of telling when you change buffer focus so I just
have it run after every command.

#+name: god-mode
#+begin_src emacs-lisp
  (defun god-mode-revert-if-buffer-changed (orig &rest args)
    (apply orig args)
    (when (not (eq (current-buffer) god-mode-current-buffer))
      (when god-local-mode
        (god-local-mode))
      (my/update-god-cursor)))

  (use-package god-mode
    :config
    (defvar god-mode-current-buffer nil)
    (add-hook 'post-command-hook 'my/update-god-cursor) ;; There is no good way to do this
    (advice-add 'window-configuration-change-hook :after 'my/update-god-cursor)
    (advice-add 'god-mode-maybe-activate :around 'god-mode-revert-if-buffer-changed))
#+end_src

*** general

General keybindings most of the ones i use are going to be defined here
as a general rule of thumb i am using , instead of C-c and those are going
to be defined in other packages.

#+name: general
#+begin_src emacs-lisp
  (use-package general)
#+end_src

*** key-chord

key-chord allows you to make key strokes that only trigger if you
press them fast enough. This makes for some pretty interesting
ideas and allows you to bind a nonprefix key to a prefix. This is
a very underused package imo because pressing the same character 2
times in a row is very easy.

#+name: key-chord
#+begin_src emacs-lisp
  (use-package key-chord
    :config (key-chord-mode 1))
#+end_src

*** avy


Avy is nice to use. Its hard to explain just look at the [[https://github.com/abo-abo/avy][github]] gifs.
#+name: avy
#+begin_src emacs-lisp
  (use-package avy)
#+end_src

** Fuzzy Find
