docs/index.html

<div id="outline-container-org526891e" class="outline-2">
<h2 id="org526891e">Core</h2>
<div class="outline-text-2" id="text-org526891e">
</div>
<div id="outline-container-orgc64e50e" class="outline-3">
<h3 id="orgc64e50e">Key Packages</h3>
<div class="outline-text-3" id="text-orgc64e50e">
</div>
<div id="outline-container-orgb599d69" class="outline-4">
<h4 id="orgb599d69">evil</h4>
<div class="outline-text-4" id="text-orgb599d69">
<p>
Evil is vi emulation in emacs. It is by far the best vi emulation
outside of vi itself and very extendable/fast.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0828f10"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">evil</span>
  <span style="color: #8EBCBB;">:config</span> 
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> evil-default-state 'emacs<span style="color: #B58DAE;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">For now this will always be emacs state so i get used to it</span>
  <span style="color: #B58DAE;">(</span>evil-mode 1<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
<code>evil-collection</code> is a project which provides evil keybindings for
almost every popular plugin in emacs outside of a few. Its really
nice if you want to use evil in buffers where its very emacsy. A
list of all keybindings and supported packages can be found
<a href="https://github.com/emacs-evil/evil-collection">here</a>. One of the nonsupported packages is magit so here is
<a href="config.html#MissingReference">evil-magit</a> config. Also <a href="#org660c1a7">1</a> has to load before evil so it
needs to set evil-want-keybinding to nil.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgae4e757"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">evil-collection</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>evil evil-magit<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>evil-collection-init<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
<code>evil-goggles</code> makes it so that every edit you do is highlighted
for a brief period of time. This makes it much easier to know
exactly what you are doing and also looks cool af.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5a00e6c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">evil-goggles</span>
  <span style="color: #8EBCBB;">:after</span> evil
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">progn</span>
            <span style="color: #A2BF8A;">(</span>evil-goggles-mode<span style="color: #A2BF8A;">)</span>
            <span style="color: #A2BF8A;">(</span>evil-goggles-use-diff-faces<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
<code>evil-matchit</code> makes % work for alot of different things. All of
them are listed <a href="https://github.com/redguardtoo/evil-matchit">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0b6be30"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">evil-matchit</span>
  <span style="color: #8EBCBB;">:after</span> evil
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>global-evil-matchit-mode 1<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f9b75c" class="outline-4">
<h4 id="org3f9b75c">god mode</h4>
<div class="outline-text-4" id="text-org3f9b75c">
<p>
God mode is a way to bring a prefix like style of keybinds to
emacs. It allows you to press a prefix key then all your keybinds
are like holding Control. In order to "let go" of the control you
press spacebar first. In order to use alt instead do a g prefix. A
G prefix its the same as Control and Alt. Color wise I have it use
a yellow box and a green underscore for normal emacs mode. There
is no good way of telling when you change buffer focus so I just
have it run after every command.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6897993"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">god-mode-revert-if-buffer-changed</span> <span style="color: #B58DAE;">(</span>orig <span style="color: #ECCC87;">&amp;rest</span> args<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>apply orig args<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #A2BF8A;">(</span>not <span style="color: #D2876D;">(</span>eq <span style="color: #5D80AE;">(</span>current-buffer<span style="color: #5D80AE;">)</span> god-mode-current-buffer<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">when</span> god-local-mode
      <span style="color: #D2876D;">(</span>god-local-mode<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>my/update-god-cursor<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>

<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">god-mode</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">defvar</span> <span style="color: #dac6d6;">god-mode-current-buffer</span> nil<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>add-hook 'post-command-hook 'my/update-god-cursor<span style="color: #B58DAE;">)</span> <span style="color: #747474;">;; </span><span style="color: #747474;">There is no good way to do this</span>
  <span style="color: #B58DAE;">(</span>advice-add 'window-configuration-change-hook <span style="color: #8EBCBB;">:after</span> 'my/update-god-cursor<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>advice-add 'god-mode-maybe-activate <span style="color: #8EBCBB;">:around</span> 'god-mode-revert-if-buffer-changed<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1cbd6fa" class="outline-4">
<h4 id="org1cbd6fa">general</h4>
<div class="outline-text-4" id="text-org1cbd6fa">
<p>
General keybindings most of the ones i use are going to be defined here
as a general rule of thumb i am using , instead of C-c and those are going
to be defined in other packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0bc424a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">general</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee21590" class="outline-4">
<h4 id="orgee21590">key-chord</h4>
<div class="outline-text-4" id="text-orgee21590">
<p>
key-chord allows you to make key strokes that only trigger if you
press them fast enough. This makes for some pretty interesting
ideas and allows you to bind a nonprefix key to a prefix. This is
a very underused package imo because pressing the same character 2
times in a row is very easy.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaca447c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">key-chord</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>key-chord-mode 1<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d414c4" class="outline-4">
<h4 id="org3d414c4">avy</h4>
<div class="outline-text-4" id="text-org3d414c4">
<p>
Avy is nice to use. Its hard to explain just look at the <a href="https://github.com/abo-abo/avy">github</a> gifs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org227c162"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">avy</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>
