docs/index.org
*** helm

Helm is a fuzzy finder search for ANYTHING you want in emacs. It
also has alot of plugins that work with other plugins. The two
alternatives is ivy and ido. Helm is the heaviest however it also
has the most features. Ivy is the simpliest and has the smallest
code base. Ivy is also very extendable and easier to work with
then helm or ido. Ido comes default with emacs and is said to be
the fastest but has a more complex code base then ivy.

Helm has actions based on whatever you want to do at that
point. You can think of it like a litteral search based tui.

#+name: helm
#+begin_src emacs-lisp
  (defun my/helm-projectile-from-find-files ()
    (interactive)
    (helm-run-after-exit
     (lambda ()
       (let ((default-directory helm-ff-default-directory)
             (projectile-require-project-root nil))
         (helm-projectile-find-file-dwim)))))
  ;; This is mainly for [[helm-projectile]]
  (defun my/helm-goto-find-files ()
    (interactive)
    (helm-run-after-exit
     (lambda ()
       (let ((default-directory (helm-basedir (helm-get-selection))))
         (helm-find-files nil)))))

  (defun my/helm-goto-helm-occur ()
    (interactive)
    (helm-run-after-exit
     (lambda ()
       (helm-occur))))

  (defun my/helm-goto-helm-rg ()
    (interactive)
    (helm-run-after-exit
     (lambda ()
       (my/helm-projectile-search-or-project))))

  (use-package helm
    :init
    (setq helm-follow-mode-persistent t
          helm-autoresize-max-height 40
          helm-display-header-line nil)
    :config
    (require 'helm-config)
    (helm-autoresize-mode t)
    (add-hook 'helm-minibuffer-set-up-hook 'helm-hide-minibuffer-maybe)
    (helm-mode t))
#+end_src

Helm has a plugin you can use to use ripgrep as the search
tool. This is required if I want to use helm-projectile-rg.

#+name: helm-rg
#+begin_src emacs-lisp
  (use-package helm-rg
    :after helm)
#+end_src

*** SOMEDAY ido
*** SOMEDAY ivy
** Version Control
*** Git
**** Magit

Magit is one of the greatest emacs packages to exist. It allows
the power of git in a tui/gui/cli form depending on what is
needed. Note this is disabled because it is not [[evil]] enough

#+name: magit
#+begin_src emacs-lisp
  (use-package magit)
#+end_src

**** Forge

This is in beta but forge allows [[magit]] to talk to github and
gitlab in order to deal with Pull Requests and Issues.

#+name: forge
#+begin_src emacs-lisp
  (use-package forge
    :after magit)
#+end_src
**** evil-magit

[[Magit]] isnt [[evil]] enough. It doesnt have standard [[evil]] keybindings
and rebinds stuff like j and k. evil-magit fixes this by
rebinding them and this is one of the only packages that isnt
supported by [[evil-collection]]. For some fucking reason this has to
load before evil so it also needs evil-want-keybinding for
[[evil-collection]].

#+name: evil-magit
#+begin_src emacs-lisp
  (use-package evil-magit
    :init (setq evil-want-keybinding nil))
#+end_src

**** magit-todos

Magit todos is interesting as it reads TODO's from the source
code comments or org buffers. It also allows you to view and sort
them which is insanely useful. It also reads the author name. It
requires either GNU grep, git grep or ripgrep which i should have
one of those anyway(also needs PCRE support). 

#+name: magit-todos
#+begin_src emacs-lisp
  (use-package magit-todos
    :config (magit-todos-mode))
#+end_src

**** Git Timemachine

This package allows you to go back and forth between a files git
history. 

#+name: git-timemachine
#+begin_src emacs-lisp
  (use-package git-timemachine
    :bind ("C-c g t" . 'git-timemachine-toggle))
#+end_src

**** Git Gutter

Shows changes, deletions or additions from master. Really useful
to see what you did and what will or wont be committed without
having to open up [[magit]].

#+name: git-gutter
#+begin_src emacs-lisp
  (use-package git-gutter 
    :config (global-git-gutter-mode)) 
#+end_src
*** SOMEDAY vcmode
** Autocompletion
