docs/index.html

<div id="outline-container-orgc367dee" class="outline-3">
<h3 id="orgc367dee">Fuzzy Find</h3>
<div class="outline-text-3" id="text-orgc367dee">
</div>
<div id="outline-container-org9635113" class="outline-4">
<h4 id="org9635113">helm</h4>
<div class="outline-text-4" id="text-org9635113">
<p>
Helm is a fuzzy finder search for ANYTHING you want in emacs. It
also has alot of plugins that work with other plugins. The two
alternatives is ivy and ido. Helm is the heaviest however it also
has the most features. Ivy is the simpliest and has the smallest
code base. Ivy is also very extendable and easier to work with
then helm or ido. Ido comes default with emacs and is said to be
the fastest but has a more complex code base then ivy.
</p>

<p>
Helm has actions based on whatever you want to do at that
point. You can think of it like a litteral search based tui.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd0a236a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-projectile-from-find-files</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-run-after-exit
   <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #D2876D;">()</span>
     <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #5D80AE;">(</span><span style="color: #ECCC87;">(</span>default-directory helm-ff-default-directory<span style="color: #ECCC87;">)</span>
           <span style="color: #ECCC87;">(</span>projectile-require-project-root nil<span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
       <span style="color: #5D80AE;">(</span>helm-projectile-find-file-dwim<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;; </span><span style="color: #747474;">This is mainly for [[helm-projectile]]</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-goto-find-files</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-run-after-exit
   <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #D2876D;">()</span>
     <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #5D80AE;">(</span><span style="color: #ECCC87;">(</span>default-directory <span style="color: #8EBCBB;">(</span>helm-basedir <span style="color: #a2b6da;">(</span>helm-get-selection<span style="color: #a2b6da;">)</span><span style="color: #8EBCBB;">)</span><span style="color: #ECCC87;">)</span><span style="color: #5D80AE;">)</span>
       <span style="color: #5D80AE;">(</span>helm-find-files nil<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>

<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-goto-helm-occur</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-run-after-exit
   <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #D2876D;">()</span>
     <span style="color: #D2876D;">(</span>helm-occur<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>

<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">my/helm-goto-helm-rg</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-run-after-exit
   <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #D2876D;">()</span>
     <span style="color: #D2876D;">(</span>my/helm-projectile-search-or-project<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>

<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">helm</span>
  <span style="color: #8EBCBB;">:init</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> helm-follow-mode-persistent t
        helm-autoresize-max-height 40
        helm-display-header-line nil<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">helm-config</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-autoresize-mode t<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>add-hook 'helm-minibuffer-set-up-hook 'helm-hide-minibuffer-maybe<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-mode t<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Helm has a plugin you can use to use ripgrep as the search
tool. This is required if I want to use helm-projectile-rg.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaa5fa4a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">helm-rg</span>
  <span style="color: #8EBCBB;">:after</span> helm<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org86d4949" class="outline-4">
<h4 id="org86d4949"><span class="todo SOMEDAY">SOMEDAY</span> ido</h4>
</div>
<div id="outline-container-org182a7c4" class="outline-4">
<h4 id="org182a7c4"><span class="todo SOMEDAY">SOMEDAY</span> ivy</h4>
</div>
</div>
<div id="outline-container-orge154d8a" class="outline-3">
<h3 id="orge154d8a">Version Control</h3>
<div class="outline-text-3" id="text-orge154d8a">
</div>
<div id="outline-container-org2578ea4" class="outline-4">
<h4 id="org2578ea4">Git</h4>
<div class="outline-text-4" id="text-org2578ea4">
</div>
<ul class="org-ul">
<li><a id="org86b7948"></a>Magit<br />
<div class="outline-text-5" id="text-org86b7948">
<p>
Magit is one of the greatest emacs packages to exist. It allows
the power of git in a tui/gui/cli form depending on what is
needed. Note this is disabled because it is not <a href="#org0828f10">1</a> enough
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgaf008ed"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">magit</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org856a0cc"></a>Forge<br />
<div class="outline-text-5" id="text-org856a0cc">
<p>
This is in beta but forge allows <a href="#orgaf008ed">1</a> to talk to github and
gitlab in order to deal with Pull Requests and Issues.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgce23926"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">forge</span>
  <span style="color: #8EBCBB;">:after</span> magit<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgd5c141b"></a>evil-magit<br />
<div class="outline-text-5" id="text-orgd5c141b">
<p>
<a href="#org86b7948">Magit</a> isnt <a href="#org0828f10">1</a> enough. It doesnt have standard <a href="#org0828f10">1</a> keybindings
and rebinds stuff like j and k. evil-magit fixes this by
rebinding them and this is one of the only packages that isnt
supported by <a href="#orgae4e757">1</a>. For some fucking reason this has to
load before evil so it also needs evil-want-keybinding for
<a href="#orgae4e757">1</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org660c1a7"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">evil-magit</span>
  <span style="color: #8EBCBB;">:init</span> <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> evil-want-keybinding nil<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org39fa32b"></a>magit-todos<br />
<div class="outline-text-5" id="text-org39fa32b">
<p>
Magit todos is interesting as it reads TODO's from the source
code comments or org buffers. It also allows you to view and sort
them which is insanely useful. It also reads the author name. It
requires either GNU grep, git grep or ripgrep which i should have
one of those anyway(also needs PCRE support). 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2918a99"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">magit-todos</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>magit-todos-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgae099bd"></a>Git Timemachine<br />
<div class="outline-text-5" id="text-orgae099bd">
<p>
This package allows you to go back and forth between a files git
history. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4892b34"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">git-timemachine</span>
  <span style="color: #8EBCBB;">:bind</span> <span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">"C-c g t"</span> . 'git-timemachine-toggle<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgd7e642f"></a>Git Gutter<br />
<div class="outline-text-5" id="text-orgd7e642f">
<p>
Shows changes, deletions or additions from master. Really useful
to see what you did and what will or wont be committed without
having to open up <a href="#orgaf008ed">1</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org865e70f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">git-gutter</span> 
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>global-git-gutter-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span> 
</pre>
</div>
</div>
</li>
</ul>
</div>
