docs/index.org
*** Company

Company is the newest and greatest auto completion engine for
emacs. Technically these have binds but I am not really counting
those as real keybindings because its only in effect during a
completion.

#+name: company
#+begin_src emacs-lisp
  (use-package company
    :init
    (add-hook 'after-init-hook 'global-company-mode)
    (setq company-require-match 'never
          company-minimum-prefix-length 2
          company-tooltip-align-annotations t
          company-idle-delay 1
          company-tooltip-limit 20
          global-company-mode t)
    :bind (:map company-active-map
                ("S-TAB" . company-select-previous)
                ("<backtab>" . company-select-previous)
                ("<return>" . nil)
                ("RET" . nil)
                ("C-SPC" . company-complete-selection)
                ("TAB" . company-complete-common-or-cycle)))
#+end_src

This is also intergrated with [[yasnippet]] for a whole bunhc of
functions.

#+name: company-mode-with-yas
#+begin_src emacs-lisp
  (defun company-mode-with-yas (backend)
    (if (and (listp backend) (member 'company-yasnippet backend))
        backend
      (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet))))

  (with-eval-after-load "company"
    (with-eval-after-load "yasnippet"
      '(setq company-backends (mapcar #'company-mode-with-yas company-backends))))
#+end_src

** Projects
*** projectile

Projectile is a way to use specific commands for a specific
project. A project is any folder with a source control or a
.projectile file/folder. This is the definition of helm-projectile
however it also installs projectile. This is also intergrated into
[[helm]].

#+name: helm-projectile
#+begin_src emacs-lisp
  (use-package helm-projectile
    :init
    (setq projectile-enable-caching t
          projectile-file-exists-local-cache-expire (* 5 60)
          projectile-file-exists-remote-cache-expire (* 10 60)
          projectile-switch-project-action 'helm-projectile-find-file
          projectile-sort-order 'recently-active)
    :config
    (projectile-mode t)
    (helm-projectile-on))
#+end_src

*** treemacs
<<treemacs-evil>><<treemacs-projectile>><<treemacs-magit>>

Treemacs is a tree layout file explorer. Its useful for projects
and has TONS of plugins to work with other plugins. It works with
[[evil]],[[projectile]], and [[magit]]. It also should have =all-the-icons= to
look pretty :p.

#+name: treemacs
#+begin_src emacs-lisp
  (use-package treemacs)
  (use-package treemacs-evil
    :after '(treemacs evil))
  (use-package treemacs-projectile
    :after '(treemacs projectile))
  (use-package treemacs-magit
    :after '(treemacs magit))
  ;; Icons for treemacs
  (use-package all-the-icons)
#+end_src

** Plain Text Modes
