docs/index.html
<div id="outline-container-org4c0f4a1" class="outline-4">
<h4 id="org4c0f4a1"><span class="todo SOMEDAY">SOMEDAY</span> vcmode</h4>
</div>
</div>
<div id="outline-container-org19ae2d4" class="outline-3">
<h3 id="org19ae2d4">Autocompletion</h3>
<div class="outline-text-3" id="text-org19ae2d4">
</div>
<div id="outline-container-org0115e0d" class="outline-4">
<h4 id="org0115e0d">Company</h4>
<div class="outline-text-4" id="text-org0115e0d">
<p>
Company is the newest and greatest auto completion engine for
emacs. Technically these have binds but I am not really counting
those as real keybindings because its only in effect during a
completion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge0ba36b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">company</span>
  <span style="color: #8EBCBB;">:init</span>
  <span style="color: #B58DAE;">(</span>add-hook 'after-init-hook 'global-company-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> company-require-match 'never
        company-minimum-prefix-length 2
        company-tooltip-align-annotations t
        company-idle-delay 1
        company-tooltip-limit 20
        global-company-mode t<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:bind</span> <span style="color: #B58DAE;">(</span><span style="color: #8EBCBB;">:map</span> company-active-map
              <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"S-TAB"</span> . company-select-previous<span style="color: #A2BF8A;">)</span>
              <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"&lt;backtab&gt;"</span> . company-select-previous<span style="color: #A2BF8A;">)</span>
              <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"&lt;return&gt;"</span> . nil<span style="color: #A2BF8A;">)</span>
              <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"RET"</span> . nil<span style="color: #A2BF8A;">)</span>
              <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"C-SPC"</span> . company-complete-selection<span style="color: #A2BF8A;">)</span>
              <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"TAB"</span> . company-complete-common-or-cycle<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This is also intergrated with <a href="#org7f59685">1</a> for a whole bunhc of
functions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0a0cbae"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">company-mode-with-yas</span> <span style="color: #B58DAE;">(</span>backend<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">and</span> <span style="color: #D2876D;">(</span>listp backend<span style="color: #D2876D;">)</span> <span style="color: #D2876D;">(</span>member 'company-yasnippet backend<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
      backend
    <span style="color: #A2BF8A;">(</span>append <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #5D80AE;">(</span>consp backend<span style="color: #5D80AE;">)</span> backend <span style="color: #5D80AE;">(</span>list backend<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
            '<span style="color: #D2876D;">(</span><span style="color: #8EBCBB;">:with</span> company-yasnippet<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>

<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">with-eval-after-load</span> <span style="color: #A2BF8A;">"company"</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">with-eval-after-load</span> <span style="color: #A2BF8A;">"yasnippet"</span>
    '<span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">setq</span> company-backends <span style="color: #D2876D;">(</span>mapcar #'company-mode-with-yas company-backends<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2203df7" class="outline-3">
<h3 id="org2203df7">Projects</h3>
<div class="outline-text-3" id="text-org2203df7">
</div>
<div id="outline-container-orga62588f" class="outline-4">
<h4 id="orga62588f">projectile</h4>
<div class="outline-text-4" id="text-orga62588f">
<p>
Projectile is a way to use specific commands for a specific
project. A project is any folder with a source control or a
.projectile file/folder. This is the definition of helm-projectile
however it also installs projectile. This is also intergrated into
<a href="#orgd0a236a">1</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org91dbf18"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">helm-projectile</span>
  <span style="color: #8EBCBB;">:init</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> projectile-enable-caching t
        projectile-file-exists-local-cache-expire <span style="color: #A2BF8A;">(</span>* 5 60<span style="color: #A2BF8A;">)</span>
        projectile-file-exists-remote-cache-expire <span style="color: #A2BF8A;">(</span>* 10 60<span style="color: #A2BF8A;">)</span>
        projectile-switch-project-action 'helm-projectile-find-file
        projectile-sort-order 'recently-active<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span>projectile-mode t<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>helm-projectile-on<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb583094" class="outline-4">
<h4 id="orgb583094">treemacs</h4>
<div class="outline-text-4" id="text-orgb583094">
<p>
<a id="org3c04ad1"></a><a id="org81f40fd"></a><a id="org9058688"></a>
</p>

<p>
Treemacs is a tree layout file explorer. Its useful for projects
and has TONS of plugins to work with other plugins. It works with
<a href="#org0828f10">1</a>,<a href="#orga62588f">projectile</a>, and <a href="#orgaf008ed">1</a>. It also should have <code>all-the-icons</code> to
look pretty :p.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd124983"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">treemacs</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">treemacs-evil</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>treemacs evil<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">treemacs-projectile</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>treemacs projectile<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">treemacs-magit</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>treemacs magit<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;; </span><span style="color: #747474;">Icons for treemacs</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">all-the-icons</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb1c01ab" class="outline-3">
<h3 id="orgb1c01ab">Plain Text Modes</h3>
<div class="outline-text-3" id="text-orgb1c01ab">
</div>
