docs/index.org
*** Org

Org mode is the best thing since sliced bread. It allows you to do
Outlines, Planning, Capturing, Spreadsheets, Markup, Exporting,
Literite Programming and much [[https://orgmode.org/][more]].

#+name: org
#+begin_src emacs-lisp
  (use-package org
    :ghook #'org-indent-mode
    :init
    (setq-default initial-major-mode 'org-mode
                  initial-scratch-message ""
                  org-src-tab-acts-natively t
                  org-confirm-babel-evaluate nil
                  org-return-follows-link t)
    (setq org-log-done 'time
          org-todo-keywords '((sequence "TODO(t)" "SOMEDAY(s)" "NEXT(n)" "|")
                              (sequence "WORKING(w!)" "BLOCKED(B@)" "|")
                              (sequence "REPORT(r)" "BUG(b)" "KNOWN(k)" "|" "FIXED(f!)")
                              (sequence "|" "DONE(d)" "CANCEL(c@)")
                              (sequence "|" "STUDY(y!)")))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((org . t)
       (C . t)
       (latex . t)
       (emacs-lisp . t)
       (sql . t)
       (shell . t)
       (python . t))))
#+end_src
<<org-rifle>>

Org rifle is a thing that helps me search a org mode multiple org
mode buffers with [[helm]] I am mainly gonna use it to search for
locations. Note this requires [[helm]]

#+name: helm-org-rifle
#+begin_src emacs-lisp
  (use-package helm-org-rifle
    :after '(org helm))
#+end_src

**** Org Exports
<<ox-pandoc>><<htmlize>><<ox-twbs>><<ox-hugo>>
There are many plugins you can install to get more exports. Here
are the 3 that I use frequently. Pandoc is nice for docx, htmlize
is for html and ox-twbs is for better html docs with
twitter-bootstrap. ox-hugo because the markdown specs are awful
and very vague so this one works on the static site generator
[[https://gohugo.io][hugo]]. See [[https://ox-hugo.scripter.co][here]] for doucmentation on it.

#+name: org-exports
#+begin_src emacs-lisp
  (use-package ox-pandoc
    :after org)
  (use-package htmlize
    :after org)
  (use-package ox-twbs
    :after org)
  (use-package ox-hugo
    :after org)
#+end_src

**** Evil org mode

[[Org]] mode is nice but [[evil]] is also very nice. Here is the only
other one then [[magit]] that doesnt have [[evil-collection]]
keybindings.

#+name: evil-org
#+begin_src emacs-lisp
  (use-package evil-org
    :after '(org evil)
    :ghook ('org-mode-hook #'evil-org-mode)
    :config
    (evil-org-set-key '(navigation insert textobjects additional calendar))
    (evil-org-agenda-set-keys))
#+end_src
*** LaTeX
**** TODO Auctex
- Note taken on [2019-08-18 Sun 21:52]  \\
  Add MLA style LaTeX template
<<latex>>

Auctex is supposed to be really good at showing and displaying
LaTeX. I should use latex but I normally just use org-mode.

#+name: auctex
#+begin_src emacs-lisp
  (use-package tex
    :ensure auctex
    :config
    (setq TeX-auto-save t
          TeX-parse-self t
          TeX-view-program-selection '(((output-dvi has-no-display-manager)
                                        "dvi2tty")
                                       ((output-dvi style-pstricks)
                                        "dvips and gv")
                                       (output-dvi "xdvi")
                                       (output-pdf "mupdf")
                                       (output-html "xdg-open")))
    (add-to-list 'TeX-view-program-list '("mupdf" "mupdf %o")))
#+end_src

It also has a [[company]] backend

#+name: company-auctex
#+begin_src emacs-lisp
  (use-package company-auctex
    :after '(company tex)
    :config (company-auctex-init))
#+end_src

*** Markdown
<<markdown>>

Markdown is dope and even though I would love to use org-mode for
everything sometimes I have to edit/view markdown.

#+name: markdown-mode
#+begin_src emacs-lisp
  (use-package markdown-mode)
#+end_src

** Terminals
