docs/index.html
<div id="outline-container-org4e94f31" class="outline-4">
<h4 id="org4e94f31">Org</h4>
<div class="outline-text-4" id="text-org4e94f31">
<p>
Org mode is the best thing since sliced bread. It allows you to do
Outlines, Planning, Capturing, Spreadsheets, Markup, Exporting,
Literite Programming and much <a href="https://orgmode.org/">more</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4f0d1de"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">org</span>
  <span style="color: #8EBCBB;">:ghook</span> #'org-indent-mode
  <span style="color: #8EBCBB;">:init</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq-default</span> initial-major-mode 'org-mode
                initial-scratch-message <span style="color: #A2BF8A;">""</span>
                org-src-tab-acts-natively t
                org-confirm-babel-evaluate nil
                org-return-follows-link t<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> org-log-done 'time
        org-todo-keywords '<span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>sequence <span style="color: #A2BF8A;">"</span><span style="color: #cc9393;">TODO</span><span style="color: #A2BF8A;">(t)"</span> <span style="color: #A2BF8A;">"SOMEDAY(s)"</span> <span style="color: #A2BF8A;">"</span><span style="color: #dca3a3;">NEXT</span><span style="color: #A2BF8A;">(n)"</span> <span style="color: #A2BF8A;">"|"</span><span style="color: #D2876D;">)</span>
                            <span style="color: #D2876D;">(</span>sequence <span style="color: #A2BF8A;">"WORKING(w!)"</span> <span style="color: #A2BF8A;">"BLOCKED(B@)"</span> <span style="color: #A2BF8A;">"|"</span><span style="color: #D2876D;">)</span>
                            <span style="color: #D2876D;">(</span>sequence <span style="color: #A2BF8A;">"REPORT(r)"</span> <span style="color: #A2BF8A;">"BUG(b)"</span> <span style="color: #A2BF8A;">"KNOWN(k)"</span> <span style="color: #A2BF8A;">"|"</span> <span style="color: #A2BF8A;">"FIXED(f!)"</span><span style="color: #D2876D;">)</span>
                            <span style="color: #D2876D;">(</span>sequence <span style="color: #A2BF8A;">"|"</span> <span style="color: #A2BF8A;">"</span><span style="color: #afd8af;">DONE</span><span style="color: #A2BF8A;">(d)"</span> <span style="color: #A2BF8A;">"CANCEL(c@)"</span><span style="color: #D2876D;">)</span>
                            <span style="color: #D2876D;">(</span>sequence <span style="color: #A2BF8A;">"|"</span> <span style="color: #A2BF8A;">"STUDY(y!)"</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>org-babel-do-load-languages
   'org-babel-load-languages
   '<span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>org . t<span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span>C . t<span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span>latex . t<span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span>emacs-lisp . t<span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span>sql . t<span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span>shell . t<span style="color: #D2876D;">)</span>
     <span style="color: #D2876D;">(</span>python . t<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
<p>
<a id="orgf459c94"></a>
</p>

<p>
Org rifle is a thing that helps me search a org mode multiple org
mode buffers with <a href="#orgd0a236a">1</a> I am mainly gonna use it to search for
locations. Note this requires <a href="#orgd0a236a">1</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org767a8b0"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">helm-org-rifle</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>org helm<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgf2324ab"></a>Org Exports<br />
<div class="outline-text-5" id="text-orgf2324ab">
<p>
<a id="org5ae72dd"></a><a id="org1f71a22"></a><a id="org94ab16f"></a><a id="orgd8a9e73"></a>
There are many plugins you can install to get more exports. Here
are the 3 that I use frequently. Pandoc is nice for docx, htmlize
is for html and ox-twbs is for better html docs with
twitter-bootstrap. ox-hugo because the markdown specs are awful
and very vague so this one works on the static site generator
<a href="https://gohugo.io">hugo</a>. See <a href="https://ox-hugo.scripter.co">here</a> for doucmentation on it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org79dbf61"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">ox-pandoc</span>
  <span style="color: #8EBCBB;">:after</span> org<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">htmlize</span>
  <span style="color: #8EBCBB;">:after</span> org<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">ox-twbs</span>
  <span style="color: #8EBCBB;">:after</span> org<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">ox-hugo</span>
  <span style="color: #8EBCBB;">:after</span> org<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga955530"></a>Evil org mode<br />
<div class="outline-text-5" id="text-orga955530">
<p>
<a href="#org4e94f31">Org</a> mode is nice but <a href="#org0828f10">1</a> is also very nice. Here is the only
other one then <a href="#orgaf008ed">1</a> that doesnt have <a href="#orgae4e757">1</a>
keybindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeb0ac47"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">evil-org</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>org evil<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:ghook</span> <span style="color: #B58DAE;">(</span>'org-mode-hook #'evil-org-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span>evil-org-set-key '<span style="color: #A2BF8A;">(</span>navigation insert textobjects additional calendar<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>evil-org-agenda-set-keys<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgc1f6ccf" class="outline-4">
<h4 id="orgc1f6ccf">LaTeX</h4>
<div class="outline-text-4" id="text-orgc1f6ccf">
</div>
<ul class="org-ul">
<li><a id="org0a11721"></a><span class="todo TODO">TODO</span> Auctex<br />
<div class="outline-text-5" id="text-org0a11721">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2019-08-18 Sun 21:52] </span></span> <br />
Add MLA style LaTeX template</li>
</ul>
<p>
<a id="org326266a"></a>
</p>

<p>
Auctex is supposed to be really good at showing and displaying
LaTeX. I should use latex but I normally just use org-mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4730659"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">tex</span>
  <span style="color: #8EBCBB;">:ensure</span> auctex
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> TeX-auto-save t
        TeX-parse-self t
        TeX-view-program-selection '<span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span><span style="color: #5D80AE;">(</span>output-dvi has-no-display-manager<span style="color: #5D80AE;">)</span>
                                      <span style="color: #A2BF8A;">"dvi2tty"</span><span style="color: #D2876D;">)</span>
                                     <span style="color: #D2876D;">(</span><span style="color: #5D80AE;">(</span>output-dvi style-pstricks<span style="color: #5D80AE;">)</span>
                                      <span style="color: #A2BF8A;">"dvips and gv"</span><span style="color: #D2876D;">)</span>
                                     <span style="color: #D2876D;">(</span>output-dvi <span style="color: #A2BF8A;">"xdvi"</span><span style="color: #D2876D;">)</span>
                                     <span style="color: #D2876D;">(</span>output-pdf <span style="color: #A2BF8A;">"mupdf"</span><span style="color: #D2876D;">)</span>
                                     <span style="color: #D2876D;">(</span>output-html <span style="color: #A2BF8A;">"xdg-open"</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>add-to-list 'TeX-view-program-list '<span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"mupdf"</span> <span style="color: #A2BF8A;">"mupdf %o"</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
It also has a <a href="#orge0ba36b">1</a> backend
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2c1203c"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">company-auctex</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>company tex<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>company-auctex-init<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org025fba3" class="outline-4">
<h4 id="org025fba3">Markdown</h4>
<div class="outline-text-4" id="text-org025fba3">
<p>
<a id="org135ce2e"></a>
</p>

<p>
Markdown is dope and even though I would love to use org-mode for
everything sometimes I have to edit/view markdown.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8316166"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">markdown-mode</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>
