docs/index.org
*** vterm

Very powerful terminal emulator as the project was started by
neovim to create a actual terminal emulator in neovim. This should
in theory be just as good. Unfortunately the [[https://melpa.org/][melpa]] package doesnt
install properly so you have to [[https://github.com/akermu/emacs-libvterm][manually]] install it. These keybinds
also don't count. [[line-numbers][Line numbers]] also dont work properly so we
disable them. Hopefully it will get [[https://github.com/akermu/emacs-libvterm/pull/129][fixed soon]].

#+name: vterm
#+begin_src emacs-lisp
  ;;(use-package vterm)
  (eval-after-load "general"
    '(when (file-directory-p "~/Projects/NotMine/emacs-libvterm")
       (add-to-list 'load-path "~/Projects/NotMine/emacs-libvterm")
       (require 'vterm)
       (general-define-key
        :states '(normal)
        :keymaps 'vterm-mode-map
        "o" #'evil-insert-resume
        "a" #'evil-insert-resume
        "i" #'evil-insert-resume
        "<return>" #'evil-insert-resume)
       (add-hook 'doc-view-mode-hook (lambda ()
                                       (global-linum-relative-mode -1)))))
#+end_src

*** eshell

Eshell is a nice interactive prompt to use with emacs. Imo this is
a really useful package as you can run shell and elisp commands
pretty easily.

#+name: eshell
#+begin_src emacs-lisp
  (defun eshell/e (file)
    (find-file file))
  (defun eshell-maybe-bol ()
    (interactive)
    (let ((p (point)))
      (eshell-bol)
      (if (= p (point))
          (beginning-of-line))))
  (add-hook 'eshell-mode-hook
            '(lambda () (define-key eshell-mode-map "\C-a" 'eshell-maybe-bol)))
#+end_src

** Templates/Snippets

Yasnippets is possibly cool? It's supposed to intergrate with
[[company]] mode if I add some code which seems cool. All this does is
add the abillity to add predefined definitions in a whole bunch of
languages.

#+name: yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :config (yas-global-mode))
#+end_src

Yasnippets requires another package for some predefined snippets so
I can actually use it without defining it myself.

#+name: yasnippet-snippets
#+begin_src emacs-lisp
  (use-package yasnippet-snippets
    :config (yasnippet-snippets-initialize))
#+end_src

*** Gentoo Snippets

Gentoo comes with a skeleton for ebuilds which is nice. I would
like to include it by default.

#+name: gentoo-snippets
#+begin_src emacs-lisp
  (add-hook 'ebuild-mode-hook 'ebuild-mode-insert-skeleton)
#+end_src

** Chat programs
*** Matrix
<<matrix>>

Matrix is nice but I know nobody on it. Too bad the emacs cilient
is actually amazing...

#+name: matrix-client
#+begin_src emacs-lisp
  (when (not (string-equal system-type "windows-nt"))
    (use-package matrix-client
      :quelpa ((matrix-client :fetcher github :repo "alphapapa/matrix-client.el"
                              :files (:defaults "logo.png" "matrix-client-standalone.el.sh")))))
#+end_src

*** Discord
**** Elcord

elcord is rich presence in discord.

#+name: elcord
#+begin_src emacs-lisp
  (use-package elcord
    :config
    (setq elcord-use-major-mode-as-main-icon t)
    (elcord-mode))
#+end_src

**** Discord-api

A project i have been working on uwu

#+name: discord-api
#+begin_src emacs-lisp
  (when (file-directory-p "~/Projects/Mine/rencord")
    (add-to-list 'load-path "~/Projects/Mine/rencord")
    (require 'rencord))
#+end_src

*** IRC
