docs/index.html

<div id="outline-container-org9ca8741" class="outline-3">
<h3 id="org9ca8741">Terminals</h3>
<div class="outline-text-3" id="text-org9ca8741">
</div>
<div id="outline-container-org5bd43f0" class="outline-4">
<h4 id="org5bd43f0">vterm</h4>
<div class="outline-text-4" id="text-org5bd43f0">
<p>
Very powerful terminal emulator as the project was started by
neovim to create a actual terminal emulator in neovim. This should
in theory be just as good. Unfortunately the <a href="https://melpa.org/">melpa</a> package doesnt
install properly so you have to <a href="https://github.com/akermu/emacs-libvterm">manually</a> install it. These keybinds
also don't count. <a href="#org4d3d1ca">Line numbers</a> also dont work properly so we
disable them. Hopefully it will get <a href="https://github.com/akermu/emacs-libvterm/pull/129">fixed soon</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6b014ac"><span style="color: #747474;">;;</span><span style="color: #747474;">(use-package vterm)</span>
<span style="color: #80A0C2;">(</span>eval-after-load <span style="color: #A2BF8A;">"general"</span>
  '<span style="color: #B58DAE;">(</span>when <span style="color: #A2BF8A;">(</span>file-directory-p <span style="color: #A2BF8A;">"~/Projects/NotMine/emacs-libvterm"</span><span style="color: #A2BF8A;">)</span>
     <span style="color: #A2BF8A;">(</span>add-to-list 'load-path <span style="color: #A2BF8A;">"~/Projects/NotMine/emacs-libvterm"</span><span style="color: #A2BF8A;">)</span>
     <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">vterm</span><span style="color: #A2BF8A;">)</span>
     <span style="color: #A2BF8A;">(</span>general-define-key
      <span style="color: #8EBCBB;">:states</span> '<span style="color: #D2876D;">(</span>normal<span style="color: #D2876D;">)</span>
      <span style="color: #8EBCBB;">:keymaps</span> 'vterm-mode-map
      <span style="color: #A2BF8A;">"o"</span> #'evil-insert-resume
      <span style="color: #A2BF8A;">"a"</span> #'evil-insert-resume
      <span style="color: #A2BF8A;">"i"</span> #'evil-insert-resume
      <span style="color: #A2BF8A;">"&lt;return&gt;"</span> #'evil-insert-resume<span style="color: #A2BF8A;">)</span>
     <span style="color: #A2BF8A;">(</span>add-hook 'doc-view-mode-hook <span style="color: #D2876D;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #5D80AE;">()</span>
                                     <span style="color: #5D80AE;">(</span>global-linum-relative-mode -1<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7675069" class="outline-4">
<h4 id="org7675069">eshell</h4>
<div class="outline-text-4" id="text-org7675069">
<p>
Eshell is a nice interactive prompt to use with emacs. Imo this is
a really useful package as you can run shell and elisp commands
pretty easily.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org26fa21a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">eshell/e</span> <span style="color: #B58DAE;">(</span>file<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>find-file file<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">defun</span> <span style="color: #8EBCBB;">eshell-maybe-bol</span> <span style="color: #B58DAE;">()</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">interactive</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">let</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>p <span style="color: #5D80AE;">(</span>point<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span>eshell-bol<span style="color: #A2BF8A;">)</span>
    <span style="color: #A2BF8A;">(</span><span style="color: #80A0C2;">if</span> <span style="color: #D2876D;">(</span>= p <span style="color: #5D80AE;">(</span>point<span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span>
        <span style="color: #D2876D;">(</span>beginning-of-line<span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>add-hook 'eshell-mode-hook
          '<span style="color: #B58DAE;">(</span>lambda <span style="color: #A2BF8A;">()</span> <span style="color: #A2BF8A;">(</span>define-key eshell-mode-map <span style="color: #A2BF8A;">"\C-a"</span> 'eshell-maybe-bol<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd9fcabc" class="outline-3">
<h3 id="orgd9fcabc">Templates/Snippets</h3>
<div class="outline-text-3" id="text-orgd9fcabc">
<p>
Yasnippets is possibly cool? It's supposed to intergrate with
<a href="#orge0ba36b">1</a> mode if I add some code which seems cool. All this does is
add the abillity to add predefined definitions in a whole bunch of
languages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7f59685"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">yasnippet</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>yas-global-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Yasnippets requires another package for some predefined snippets so
I can actually use it without defining it myself.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfe89962"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">yasnippet-snippets</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>yasnippet-snippets-initialize<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgd54fbc0" class="outline-4">
<h4 id="orgd54fbc0">Gentoo Snippets</h4>
<div class="outline-text-4" id="text-orgd54fbc0">
<p>
Gentoo comes with a skeleton for ebuilds which is nice. I would
like to include it by default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb6f344e"><span style="color: #80A0C2;">(</span>add-hook 'ebuild-mode-hook 'ebuild-mode-insert-skeleton<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org16f7749" class="outline-3">
<h3 id="org16f7749">Chat programs</h3>
<div class="outline-text-3" id="text-org16f7749">
</div>
<div id="outline-container-orgf218843" class="outline-4">
<h4 id="orgf218843">Matrix</h4>
<div class="outline-text-4" id="text-orgf218843">
<p>
<a id="org5234aac"></a>
</p>

<p>
Matrix is nice but I know nobody on it. Too bad the emacs cilient
is actually amazing&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org3370788"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #B58DAE;">(</span>not <span style="color: #A2BF8A;">(</span>string-equal system-type <span style="color: #A2BF8A;">"windows-nt"</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">matrix-client</span>
    <span style="color: #8EBCBB;">:quelpa</span> <span style="color: #A2BF8A;">(</span><span style="color: #D2876D;">(</span>matrix-client <span style="color: #8EBCBB;">:fetcher</span> github <span style="color: #8EBCBB;">:repo</span> <span style="color: #A2BF8A;">"alphapapa/matrix-client.el"</span>
                            <span style="color: #8EBCBB;">:files</span> <span style="color: #5D80AE;">(</span><span style="color: #8EBCBB;">:defaults</span> <span style="color: #A2BF8A;">"logo.png"</span> <span style="color: #A2BF8A;">"matrix-client-standalone.el.sh"</span><span style="color: #5D80AE;">)</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2abb36c" class="outline-4">
<h4 id="org2abb36c">Discord</h4>
<div class="outline-text-4" id="text-org2abb36c">
</div>
<ul class="org-ul">
<li><a id="org2ffd5c3"></a>Elcord<br />
<div class="outline-text-5" id="text-org2ffd5c3">
<p>
elcord is rich presence in discord.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org1637d73"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">elcord</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> elcord-use-major-mode-as-main-icon t<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>elcord-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org62442a8"></a>Discord-api<br />
<div class="outline-text-5" id="text-org62442a8">
<p>
A project i have been working on uwu
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org550d91f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">when</span> <span style="color: #B58DAE;">(</span>file-directory-p <span style="color: #A2BF8A;">"~/Projects/Mine/rencord"</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>add-to-list 'load-path <span style="color: #A2BF8A;">"~/Projects/Mine/rencord"</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">rencord</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
