docs/index.org
**** rcirc

This is the lightest irc client i think and comes
preinstalled. Also works pretty nice and barely requires a
config.

#+name: rcirc
#+begin_src emacs-lisp
  (setq rcirc-default-nick "Renzix"
        rcirc-server-alist
        '(("irc.freenode.net" :channels ("#emacs"))
          ("localhost" :channels ("#home")))
        rcirc-authinfo
        '(("irc.freenode.net" nickserv "Renzix" "Akeyla10!")
          ("localhost" bitlbee "Renzix" ("Akeyla10!"))))
  ;; Include date in time stamp.
  (setq rcirc-time-format "%Y-%m-%d %H:%M ")
  ;; Keep input line at bottom.                                                                               
  (add-hook 'rcirc-mode-hook
            (lambda ()
              (set (make-local-variable 'scroll-conservatively)
                   8192)))
  ;; Turn on spell checking.
  (add-hook 'rcirc-mode-hook (lambda ()
                               (flyspell-mode 1)))
#+end_src

** Visual Helpers
*** beacon

Beacon just shos a light to the location where the cursor moved
to. Simple as that.

#+name: beacon
#+begin_src emacs-lisp
  (use-package beacon
    :config (beacon-mode 1))
#+end_src

*** rainbow-delimiters

closing things get different highlighting so you can tell if it is
closed or not.

#+name: rainbow-delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ghook 'prog-mode-hook)
#+end_src

*** TODO wilfred
*** which-key

which-key shows keybindings as you press them making it much
easier. Helps ALOT when learning keybinds

#+name: which-key
#+begin_src emacs-lisp
  (use-package which-key
    :config (which-key-mode))
#+end_src

** Should Be in Emacs
*** expand-region

This is a single function package which expands the current region

#+name: expand-region
#+begin_src emacs-lisp
  (use-package expand-region
    :config (delete-selection-mode 1))
#+end_src

** Programming
*** smartparens

smartparens allows you to edit stuff inside and move around using
parens. This is pretty useful when programming so lets load that
hook here.

#+name: smartparens
#+begin_src emacs-lisp
  ;; Misc programming stuff
  (use-package smartparens
    :ghook 
    ('prog-mode-hook #'smartparens-mode)
    ('lisp-mode-hook #'smartparens-strict-mode))
#+end_src

*** LSP
<<lsp>>

lsp is basically a server that does syntax checking and stuff. The
best part about it is its editor independant so that all the
editors can improve it making it alot better.

#+name: lsp-mode
#+begin_src emacs-lisp
  (use-package lsp-mode
    :hook
    ((scala-mode . lsp)
     (java-mode . lsp)
     (python-mode . lsp)
     (c-mode . lsp))
    :config (setq lsp-prefer-flymake nil))
#+end_src

=lsp-ui= adds a inline ui element so you can see it.

#+name: lsp-ui
#+begin_src emacs-lisp
  (use-package lsp-ui
    :after lsp-mode
    :hook (lsp-mode-hook . lsp-ui-mode))
#+end_src

lsp also has [[company]] support

#+name: company-lsp
#+begin_src emacs-lisp
  (use-package company-lsp
    :after '(company lsp-mode))
#+end_src

[[lsp]] also has =dap-mode= which is in [[https://github.com/emacs-lsp/dap-mode][alpha]] and can be used to
debug. Hopefully it gets really good eventually.

#+name: dap-mode
#+begin_src emacs-lisp
  (use-package dap-mode
    :config
    (dap-mode 1)
    (dap-ui-mode 1)
    (require 'dap-python)
    (require 'dap-java)
    (require 'dap-lldb))
#+end_src

*** JVM
**** java

All i have for java is a simple [[lsp]]. Maybe eventually I will hook
up the entire eclipse server thing too.

#+name: lsp-java
#+begin_src emacs-lisp
  (use-package lsp-java)
#+end_src

