docs/index.html

<div id="outline-container-org369e4aa" class="outline-4">
<h4 id="org369e4aa">IRC</h4>
<div class="outline-text-4" id="text-org369e4aa">
</div>
<ul class="org-ul">
<li><a id="org8e9c0ad"></a>rcirc<br />
<div class="outline-text-5" id="text-org8e9c0ad">
<p>
This is the lightest irc client i think and comes
preinstalled. Also works pretty nice and barely requires a
config.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org48214f4"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> rcirc-default-nick <span style="color: #A2BF8A;">"Renzix"</span>
      rcirc-server-alist
      '<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"irc.freenode.net"</span> <span style="color: #8EBCBB;">:channels</span> <span style="color: #D2876D;">(</span><span style="color: #A2BF8A;">"#emacs"</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"localhost"</span> <span style="color: #8EBCBB;">:channels</span> <span style="color: #D2876D;">(</span><span style="color: #A2BF8A;">"#home"</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
      rcirc-authinfo
      '<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"irc.freenode.net"</span> nickserv <span style="color: #A2BF8A;">"Renzix"</span> <span style="color: #A2BF8A;">"Akeyla10!"</span><span style="color: #A2BF8A;">)</span>
        <span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"localhost"</span> bitlbee <span style="color: #A2BF8A;">"Renzix"</span> <span style="color: #D2876D;">(</span><span style="color: #A2BF8A;">"Akeyla10!"</span><span style="color: #D2876D;">)</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;; </span><span style="color: #747474;">Include date in time stamp.</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">setq</span> rcirc-time-format <span style="color: #A2BF8A;">"%Y-%m-%d %H:%M "</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;; </span><span style="color: #747474;">Keep input line at bottom.                                                                               </span>
<span style="color: #80A0C2;">(</span>add-hook 'rcirc-mode-hook
          <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #A2BF8A;">()</span>
            <span style="color: #A2BF8A;">(</span>set <span style="color: #D2876D;">(</span>make-local-variable 'scroll-conservatively<span style="color: #D2876D;">)</span>
                 8192<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #747474;">;; </span><span style="color: #747474;">Turn on spell checking.</span>
<span style="color: #80A0C2;">(</span>add-hook 'rcirc-mode-hook <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">lambda</span> <span style="color: #A2BF8A;">()</span>
                             <span style="color: #A2BF8A;">(</span>flyspell-mode 1<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7738301" class="outline-3">
<h3 id="org7738301">Visual Helpers</h3>
<div class="outline-text-3" id="text-org7738301">
</div>
<div id="outline-container-org1d761cb" class="outline-4">
<h4 id="org1d761cb">beacon</h4>
<div class="outline-text-4" id="text-org1d761cb">
<p>
Beacon just shos a light to the location where the cursor moved
to. Simple as that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgeaeefea"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">beacon</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>beacon-mode 1<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org31d5907" class="outline-4">
<h4 id="org31d5907">rainbow-delimiters</h4>
<div class="outline-text-4" id="text-org31d5907">
<p>
closing things get different highlighting so you can tell if it is
closed or not.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org685a587"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">rainbow-delimiters</span>
  <span style="color: #8EBCBB;">:ghook</span> 'prog-mode-hook<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org46b31a5" class="outline-4">
<h4 id="org46b31a5"><span class="todo TODO">TODO</span> wilfred</h4>
</div>
<div id="outline-container-org72c045c" class="outline-4">
<h4 id="org72c045c">which-key</h4>
<div class="outline-text-4" id="text-org72c045c">
<p>
which-key shows keybindings as you press them making it much
easier. Helps ALOT when learning keybinds
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb223c35"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">which-key</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>which-key-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org21c3ace" class="outline-3">
<h3 id="org21c3ace">Should Be in Emacs</h3>
<div class="outline-text-3" id="text-org21c3ace">
</div>
<div id="outline-container-org75a3475" class="outline-4">
<h4 id="org75a3475">expand-region</h4>
<div class="outline-text-4" id="text-org75a3475">
<p>
This is a single function package which expands the current region
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2b31fb4"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">expand-region</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>delete-selection-mode 1<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc179e37" class="outline-3">
<h3 id="orgc179e37">Programming</h3>
<div class="outline-text-3" id="text-orgc179e37">
</div>
<div id="outline-container-org06d904b" class="outline-4">
<h4 id="org06d904b">smartparens</h4>
<div class="outline-text-4" id="text-org06d904b">
<p>
smartparens allows you to edit stuff inside and move around using
parens. This is pretty useful when programming so lets load that
hook here.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4c156d4"><span style="color: #747474;">;; </span><span style="color: #747474;">Misc programming stuff</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">smartparens</span>
  <span style="color: #8EBCBB;">:ghook</span> 
  <span style="color: #B58DAE;">(</span>'prog-mode-hook #'smartparens-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>'lisp-mode-hook #'smartparens-strict-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7578ea" class="outline-4">
<h4 id="orgf7578ea">LSP</h4>
<div class="outline-text-4" id="text-orgf7578ea">
<p>
<a id="orgbcdc094"></a>
</p>

<p>
lsp is basically a server that does syntax checking and stuff. The
best part about it is its editor independant so that all the
editors can improve it making it alot better.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org65e565d"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">lsp-mode</span>
  <span style="color: #8EBCBB;">:hook</span>
  <span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span>scala-mode . lsp<span style="color: #A2BF8A;">)</span>
   <span style="color: #A2BF8A;">(</span>java-mode . lsp<span style="color: #A2BF8A;">)</span>
   <span style="color: #A2BF8A;">(</span>python-mode . lsp<span style="color: #A2BF8A;">)</span>
   <span style="color: #A2BF8A;">(</span>c-mode . lsp<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">setq</span> lsp-prefer-flymake nil<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
<code>lsp-ui</code> adds a inline ui element so you can see it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0cd90b8"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">lsp-ui</span>
  <span style="color: #8EBCBB;">:after</span> lsp-mode
  <span style="color: #8EBCBB;">:hook</span> <span style="color: #B58DAE;">(</span>lsp-mode-hook . lsp-ui-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
lsp also has <a href="#orge0ba36b">1</a> support
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc82a4be"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">company-lsp</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>company lsp-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
<a href="#orgbcdc094">No description for this link</a> also has <code>dap-mode</code> which is in <a href="https://github.com/emacs-lsp/dap-mode">alpha</a> and can be used to
debug. Hopefully it gets really good eventually.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org011b91a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">dap-mode</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span>dap-mode 1<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>dap-ui-mode 1<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">dap-python</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">dap-java</span><span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span><span style="color: #80A0C2;">require</span> '<span style="color: #B58DAE;">dap-lldb</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8530695" class="outline-4">
<h4 id="org8530695">JVM</h4>
<div class="outline-text-4" id="text-org8530695">
</div>
<ul class="org-ul">
<li><a id="org7140c94"></a>java<br />
<div class="outline-text-5" id="text-org7140c94">
<p>
All i have for java is a simple <a href="#orgbcdc094">No description for this link</a>. Maybe eventually I will hook
up the entire eclipse server thing too.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6bc391e"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">lsp-java</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
