docs/index.org
**** scala

Scala lsp is part of [[lsp-mode]] so you can enable/disable it from
there. Here is just syntax highlighting for scala.

#+begin_src emacs-lisp
  (use-package scala-mode
    :mode "\\.s\\(cala\\|bt\\)$")
#+end_src
<<sbt>><<sbt-mode>>

this is a mode for [[scala]] package manager sbt.

#+begin_src emacs-lisp
  (use-package sbt-mode
    :commands sbt-start sbt-command
    :config
    ;; WORKAROUND: https://github.com/ensime/emacs-sbt-mode/issues/31
    ;; allows using SPACE when in the minibuffer
    (substitute-key-definition
     'minibuffer-complete-word
     'self-insert-command
     minibuffer-local-completion-map))
#+end_src

**** SOMEDAY kotlin
**** clojure

see [[clojure]] in the lisps section.

*** Scripting langs
**** python
<<python>>

We are using [[https://github.com/microsoft/language-server-protocol][microsofts lsp]] because its supposed to be good. Thats
about it probably should add more. Also this is partially configured
in [[lsp-mode]]

#+name: lsp-python-ms
#+begin_src emacs-lisp
  (use-package lsp-python-ms)
#+end_src

**** rakudo
<<perl6-mode>><<flycheck-perl6>>

perl6 is such a cool language but its SOO slow. Feels bad. Maybe
eventually it becomes fast and good enough to be used in
industry. Note this doesnt have that good syntax highlighting and
no lsp.

#+name: perl6
#+begin_src emacs-lisp
  (use-package perl6-mode)
  (use-package flycheck-perl6
    :after flycheck)
#+end_src

**** SOMEDAY perl
**** SOMEDAY shell

*** lisps

Lisp is a really cool idea. They all have the same core idea just
change some fundemental things about it. The most used right now
are scheme, common lisp, clojure and emacs lisp. So here are the
configs for them.

**** lisp rant
Emacs lisp is probably one of the worst designed languages on
here. It has some of the complexity of common lisp and clojure
but not the simplicity of a scheme. Some differences with scheme
is that scheme has #f and #t while in emacs everything thats not
a empty list is t. No module system so everything is in a single
namespace (scheme has nonstandard ones and cl has a standard
one). Scheme also has a single namespace for variables and
functions while elisp and cl have seperate ones. In comparison to
common lisp it has WAY less standard functions which do alot
less. Also tail end recursion is actually not possible as of
right now in elisp which makes alot of things alot more
difficult. In elisp everything is also dynamic scoping meaning
that if you define a variable it is added to a global state which
is awful(you can get around this with =let=. Concurrence in elisp
is also awful. You have to use a async library which is a base
install of emacs so it becomes very hard if you use external
libraries and you have to require them inside the async function. 

**** emacs-lisp

See above for rant on elisp. This enables paredit mode for elisp
and other modes if they want it. Also does [[company]] stuff for autocompletion

**** TODO common-lisp
**** TODO clojure
**** TODO scheme
*** Microsoft/Dotnet
**** csharp
<<c#>><<omnisharp>>

csharp is still growing a emacs presence. For right now omnisharp
is what we got and its still in beta. We also have standard syntax
highlighting for it.

#+name: csharp-mode
#+begin_src emacs-lisp
  (use-package csharp-mode)
  (use-package omnisharp
    :after 'company
    :hook (csharp-mode-hook . omnisharp-mode)
    :config
    (add-to-list 'company-backends 'company-omnisharp)
    (add-to-list 'auto-mode-alist '("\\.xaml\\'" . xml-mode)))
#+end_src

**** powershell

Just a major mode and simple repl for powershell. Nothing too
major.

#+name: powershell
#+begin_src emacs-lisp
  (use-package powershell)
#+end_src

*** rust

Rust support is alright. Most things should work ootb with rustic
and [[lsp-mode]].

#+name: rustic
#+begin_src emacs-lisp
  (use-package rustic)
#+end_src

*** c and cpp
<<c>><<cpp>>

This one uses irony server which needs to be installed. Note that
it can be installed inside emacs. Uses [[lsp]] to do stuff.

#+name: irony
#+begin_src emacs-lisp
  (use-package irony
    :hook (c++-mode-hook . irony-mode)
    :hook (objc-mode-hook . irony-mode)
    :hook (c-mode-hook . irony-mode))
#+end_src

Irony also has support for [[company]].

#+name: compnay-irony
#+begin_src emacs-lisp
  (use-package company-irony
    :after '(company irony))
#+end_src

This allows us to read docs while irony is working.

#+name: irony-eldoc
#+begin_src emacs-lisp
  (use-package irony-eldoc
    :after '(irony))
#+end_src

