docs/index.html

<li><a id="org903c9e8"></a>scala<br />
<div class="outline-text-5" id="text-org903c9e8">
<p>
Scala lsp is part of <a href="#org65e565d">1</a> so you can enable/disable it from
there. Here is just syntax highlighting for scala.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">scala-mode</span>
  <span style="color: #8EBCBB;">:mode</span> <span style="color: #A2BF8A;">"\\.s</span><span style="color: #80A0C2; font-weight: bold;">\\</span><span style="color: #80A0C2; font-weight: bold;">(</span><span style="color: #A2BF8A;">cala</span><span style="color: #80A0C2; font-weight: bold;">\\</span><span style="color: #80A0C2; font-weight: bold;">|</span><span style="color: #A2BF8A;">bt</span><span style="color: #80A0C2; font-weight: bold;">\\</span><span style="color: #80A0C2; font-weight: bold;">)</span><span style="color: #A2BF8A;">$"</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
<p>
<a id="org27653db"></a><a id="orgb853c2c"></a>
</p>

<p>
this is a mode for <a href="#org903c9e8">scala</a> package manager sbt.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">sbt-mode</span>
  <span style="color: #8EBCBB;">:commands</span> sbt-start sbt-command
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #747474;">;; </span><span style="color: #747474;">WORKAROUND: https://github.com/ensime/emacs-sbt-mode/issues/31</span>
  <span style="color: #747474;">;; </span><span style="color: #747474;">allows using SPACE when in the minibuffer</span>
  <span style="color: #B58DAE;">(</span>substitute-key-definition
   'minibuffer-complete-word
   'self-insert-command
   minibuffer-local-completion-map<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org79d3340"></a><span class="todo SOMEDAY">SOMEDAY</span> kotlin<br /></li>
<li><a id="org514c114"></a>clojure<br />
<div class="outline-text-5" id="text-org514c114">
<p>
see <a href="#org514c114">clojure</a> in the lisps section.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgde109f3" class="outline-4">
<h4 id="orgde109f3">Scripting langs</h4>
<div class="outline-text-4" id="text-orgde109f3">
</div>
<ul class="org-ul">
<li><a id="org9c142f9"></a>python<br />
<div class="outline-text-5" id="text-org9c142f9">
<p>
<a id="org9211bd7"></a>
</p>

<p>
We are using <a href="https://github.com/microsoft/language-server-protocol">microsofts lsp</a> because its supposed to be good. Thats
about it probably should add more. Also this is partially configured
in <a href="#org65e565d">1</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7567c0b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">lsp-python-ms</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgcc6f482"></a>rakudo<br />
<div class="outline-text-5" id="text-orgcc6f482">
<p>
<a id="orgffd4b76"></a><a id="org558b2db"></a>
</p>

<p>
perl6 is such a cool language but its SOO slow. Feels bad. Maybe
eventually it becomes fast and good enough to be used in
industry. Note this doesnt have that good syntax highlighting and
no lsp.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9e0c0b3"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">perl6-mode</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">flycheck-perl6</span>
  <span style="color: #8EBCBB;">:after</span> flycheck<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgc101eee"></a><span class="todo SOMEDAY">SOMEDAY</span> perl<br /></li>
<li><a id="org3a04283"></a><span class="todo SOMEDAY">SOMEDAY</span> shell<br /></li>
</ul>
</div>

<div id="outline-container-org1cc2d7e" class="outline-4">
<h4 id="org1cc2d7e">lisps</h4>
<div class="outline-text-4" id="text-org1cc2d7e">
<p>
Lisp is a really cool idea. They all have the same core idea just
change some fundemental things about it. The most used right now
are scheme, common lisp, clojure and emacs lisp. So here are the
configs for them.
</p>
</div>

<ul class="org-ul">
<li><a id="org82759ee"></a>lisp rant<br />
<div class="outline-text-5" id="text-org82759ee">
<p>
Emacs lisp is probably one of the worst designed languages on
here. It has some of the complexity of common lisp and clojure
but not the simplicity of a scheme. Some differences with scheme
is that scheme has #f and #t while in emacs everything thats not
a empty list is t. No module system so everything is in a single
namespace (scheme has nonstandard ones and cl has a standard
one). Scheme also has a single namespace for variables and
functions while elisp and cl have seperate ones. In comparison to
common lisp it has WAY less standard functions which do alot
less. Also tail end recursion is actually not possible as of
right now in elisp which makes alot of things alot more
difficult. In elisp everything is also dynamic scoping meaning
that if you define a variable it is added to a global state which
is awful(you can get around this with <code>let</code>. Concurrence in elisp
is also awful. You have to use a async library which is a base
install of emacs so it becomes very hard if you use external
libraries and you have to require them inside the async function. 
</p>
</div>
</li>

<li><a id="orgd9ecdd5"></a>emacs-lisp<br />
<div class="outline-text-5" id="text-orgd9ecdd5">
<p>
See above for rant on elisp. This enables paredit mode for elisp
and other modes if they want it. Also does <a href="#orge0ba36b">1</a> stuff for autocompletion
</p>
</div>
</li>

<li><a id="orge0b8f8e"></a><span class="todo TODO">TODO</span> common-lisp<br /></li>
<li><a id="orgf71067f"></a><span class="todo TODO">TODO</span> clojure<br /></li>
<li><a id="org975341b"></a><span class="todo TODO">TODO</span> scheme<br /></li>
</ul>
</div>
<div id="outline-container-org88a9588" class="outline-4">
<h4 id="org88a9588">Microsoft/Dotnet</h4>
<div class="outline-text-4" id="text-org88a9588">
</div>
<ul class="org-ul">
<li><a id="org0bd1453"></a>csharp<br />
<div class="outline-text-5" id="text-org0bd1453">
<p>
<a id="org3c102da"></a><a id="org92a1a30"></a>
</p>

<p>
csharp is still growing a emacs presence. For right now omnisharp
is what we got and its still in beta. We also have standard syntax
highlighting for it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb852a1b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">csharp-mode</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">omnisharp</span>
  <span style="color: #8EBCBB;">:after</span> 'company
  <span style="color: #8EBCBB;">:hook</span> <span style="color: #B58DAE;">(</span>csharp-mode-hook . omnisharp-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:config</span>
  <span style="color: #B58DAE;">(</span>add-to-list 'company-backends 'company-omnisharp<span style="color: #B58DAE;">)</span>
  <span style="color: #B58DAE;">(</span>add-to-list 'auto-mode-alist '<span style="color: #A2BF8A;">(</span><span style="color: #A2BF8A;">"\\.xaml\\'"</span> . xml-mode<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org3c162bb"></a>powershell<br />
<div class="outline-text-5" id="text-org3c162bb">
<p>
Just a major mode and simple repl for powershell. Nothing too
major.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org9536971"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">powershell</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgb77e1b5" class="outline-4">
<h4 id="orgb77e1b5">rust</h4>
<div class="outline-text-4" id="text-orgb77e1b5">
<p>
Rust support is alright. Most things should work ootb with rustic
and <a href="#org65e565d">1</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org076b960"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">rustic</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e205b8" class="outline-4">
<h4 id="org2e205b8">c and cpp</h4>
<div class="outline-text-4" id="text-org2e205b8">
<p>
<a id="org051c662"></a><a id="org5b0693e"></a>
</p>

<p>
This one uses irony server which needs to be installed. Note that
it can be installed inside emacs. Uses <a href="#orgbcdc094">No description for this link</a> to do stuff.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org6ac7239"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">irony</span>
  <span style="color: #8EBCBB;">:hook</span> <span style="color: #B58DAE;">(</span>c++-mode-hook . irony-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:hook</span> <span style="color: #B58DAE;">(</span>objc-mode-hook . irony-mode<span style="color: #B58DAE;">)</span>
  <span style="color: #8EBCBB;">:hook</span> <span style="color: #B58DAE;">(</span>c-mode-hook . irony-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Irony also has support for <a href="#orge0ba36b">1</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2b98692"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">company-irony</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>company irony<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
This allows us to read docs while irony is working.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2d1217b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">irony-eldoc</span>
  <span style="color: #8EBCBB;">:after</span> '<span style="color: #B58DAE;">(</span>irony<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
