docs/index.org
*** haskell
<<lsp-haskell>><<flycheck-haskell>>

Haskell is a cool language. I should probably actually learn it one
day.

#+name: haskell-mode
#+begin_src emacs-lisp
  (use-package haskell-mode)
  (use-package lsp-haskell
    :after lsp-mode)
  (use-package flycheck-haskell
    :after flycheck)
#+end_src

*** Google
**** dart

Dart is googles new language. I doubt im ever going to use it but
it seems cool enough to try out.

#+name: dart-mode
#+begin_src emacs-lisp
  (use-package dart-mode)
#+end_src

**** golang

Go is fast/easy. First we can start off with the major mode.

#+name: go-mode
#+begin_src emacs-lisp
  (use-package go-mode)
#+end_src

Then we can give it documentation popups.

#+name: go-eldoc
#+begin_src emacs-lisp
  (use-package go-eldoc)
#+end_src

flymake-go is good i guess.

#+name: flymake-go
#+begin_src emacs-lisp
  (use-package flymake-go)
#+end_src

and finally we can give it [[company]] completion. It should
recognize it however I havent tested it yet.

#+name: company-go
#+begin_src emacs-lisp
  (use-package company-go)
#+end_src

*** Flycheck
<<flycheck-pos-tip>>

These are my flycheck settings although most packages have their
flycheck set to start in their own packages.

#+name: flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :init (global-flycheck-mode))
  (use-package flycheck-pos-tip
    :after flycheck
    :config (flycheck-pos-tip-mode))
#+end_src

*** imenu

Imenu is nice to have because you can intelligently view and move
to parts of your program. This one in perticular is able to do it
anywhere and have helm support.

#+name: imenu-anywhere
#+begin_src emacs-lisp
  (use-package imenu-anywhere)
#+end_src

* Keybindings

This is all of my defined keybinds. I use [[key-chord]] alot because its
a good package for [[evil]]. People rarely do things like ;; (M-x ;) and
other stuff. Btw the )) is on the end of the line because i may want
to comment out the last <<>> and that would actually comment ))
causing a syntax error.

** Rant on keybindings

There are a bunch of different ways on how to bind a key. I think
each way has its merit and should be thought of before you assign a
keybinding. states and prefixes are achived through
keymaps. Arguments are achieved through C-u or evil motions/
1-9/registers. chords are by key-chord or its in vim by
default. commands are by command mode in vim or M-x in
emacs. Modifiers are just control alt and shift etc... The big
thing that emacs has over vim is provide context to a
function. Working differently depending on where you are is
extremely powerful. Emacs also allows making new mode maps which is
the other big thing that emacs does better. Note keymaps are a
combination of states and prefixes. Vim arguments work better
however C-u is a VERY interesting idea. vim also loses to
major/minor modes as this makes plugins ALOT more modular. Allowing
multiple ways to look at a single file depending on context. I dont
absolutely hate the idea of using a mouse like in acme however I
will mention that the more you use the mouse the more likely you
will keep trying to use it. In that case you end up abandonning the
keyboard for long periods of times making it worse. Pressing escape
to do 60+ keybindings is MUCH more efficent then reaching over to
your mouse for a max of 20 keybinds which are context dependant. It
may however be easier to understand at first.

- states (insert or normal)
- prefix (emacs C-x or vim C-w)
- modes (major/minor modes or file types)
- argument (2dd or C-u)
- chords (keychord)
- commands (M-x or ex-commands)
- modifers (C-y or C-S-<backspace>)
- context (org mode C-c C-c or [[https://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][this]])
- mouse (plan 9's acme?)

** Emacs State

Yes i want to be able to use emacs because i think its important to
understand different ways of doing things. Because of this I am
going to make it a 66% on startup of whether evil mode is enabled
or not. [[http://www.elmindreda.org/emacs.html][This is nice if I forget keybinds]].

#+name: keybinds-emacs
#+begin_src emacs-lisp
  (general-define-key
   :states '(emacs)
   "M-x" 'helm-M-x
   "C-x C-f" 'helm-find-files
   "C-x f" 'helm-locate
   "C-x C-b" 'helm-buffers-list
   "C-x b" 'helm-multi-files
   "C-x g" 'magit-status
   "C-x C-g" 'magit-dispatch
   "C-x C-o" 'other-window
   "C-x C-k" 'kill-this-buffer
   "C-x v" 'revert-buffer
   "C-x t" 'my/eshell-toggle
   "C-x C-t" 'my/vterm-toggle
   "M-j" 'delete-blank-lines ;; @TODO(renzix): Make this also join the previous line if no blank lines?
   "C-o" 'my/smart-open-line
   "C-\\" 'er/expand-region
   "C-." 'repeat
   "<escape>" 'god-local-mode
   "C-=" 'my/smart-indent
   "C-j" 'avy-goto-char-2
   "C-'" 'my/helm-projectile-find-file-or-find-file
   "M-'" 'my/helm-projectile-find-file-or-project
   "M-\"" 'my/helm-projectile-search-or-project
   "C-\"" 'helm-occur
   "C-|" 'helm-mini
   "C-:" 'helm-bookmarks
   "M-p" 'projectile-command-map
   "M-m" 'evilmi-jump-items
   "C-c h" 'helm-command-prefix
   "C-a" 'my/move-beginning-of-line)
#+end_src

