docs/index.html

<div id="outline-container-orgc8febeb" class="outline-4">
<h4 id="orgc8febeb">haskell</h4>
<div class="outline-text-4" id="text-orgc8febeb">
<p>
<a id="orgc969593"></a><a id="orge9bad8d"></a>
</p>

<p>
Haskell is a cool language. I should probably actually learn it one
day.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge64c0e4"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">haskell-mode</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">lsp-haskell</span>
  <span style="color: #8EBCBB;">:after</span> lsp-mode<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">flycheck-haskell</span>
  <span style="color: #8EBCBB;">:after</span> flycheck<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa19064" class="outline-4">
<h4 id="orgaa19064">Google</h4>
<div class="outline-text-4" id="text-orgaa19064">
</div>
<ul class="org-ul">
<li><a id="org7dc98e9"></a>dart<br />
<div class="outline-text-5" id="text-org7dc98e9">
<p>
Dart is googles new language. I doubt im ever going to use it but
it seems cool enough to try out.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd6debc6"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">dart-mode</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgfd79eb9"></a>golang<br />
<div class="outline-text-5" id="text-orgfd79eb9">
<p>
Go is fast/easy. First we can start off with the major mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf5fcf0b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">go-mode</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
Then we can give it documentation popups.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4c92e0f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">go-eldoc</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
flymake-go is good i guess.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org22a454f"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">flymake-go</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<p>
and finally we can give it <a href="#orge0ba36b">1</a> completion. It should
recognize it however I havent tested it yet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org84f521a"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">company-go</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge438f2b" class="outline-4">
<h4 id="orge438f2b">Flycheck</h4>
<div class="outline-text-4" id="text-orge438f2b">
<p>
<a id="org7eec0f0"></a>
</p>

<p>
These are my flycheck settings although most packages have their
flycheck set to start in their own packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge27080b"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">flycheck</span>
  <span style="color: #8EBCBB;">:init</span> <span style="color: #B58DAE;">(</span>global-flycheck-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">flycheck-pos-tip</span>
  <span style="color: #8EBCBB;">:after</span> flycheck
  <span style="color: #8EBCBB;">:config</span> <span style="color: #B58DAE;">(</span>flycheck-pos-tip-mode<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa006a0" class="outline-4">
<h4 id="orgaa006a0">imenu</h4>
<div class="outline-text-4" id="text-orgaa006a0">
<p>
Imenu is nice to have because you can intelligently view and move
to parts of your program. This one in perticular is able to do it
anywhere and have helm support.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgfd8f629"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">use-package</span> <span style="color: #B58DAE;">imenu-anywhere</span><span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org26db8fd" class="outline-2">
<h2 id="org26db8fd">Keybindings</h2>
<div class="outline-text-2" id="text-org26db8fd">
<p>
This is all of my defined keybinds. I use <a href="#orgaca447c">1</a> alot because its
a good package for <a href="#org0828f10">1</a>. People rarely do things like ;; (M-x ;) and
other stuff. Btw the )) is on the end of the line because i may want
to comment out the last &lt;&lt;&gt;&gt; and that would actually comment ))
causing a syntax error.
</p>
</div>

<div id="outline-container-orga546eef" class="outline-3">
<h3 id="orga546eef">Rant on keybindings</h3>
<div class="outline-text-3" id="text-orga546eef">
<p>
There are a bunch of different ways on how to bind a key. I think
each way has its merit and should be thought of before you assign a
keybinding. states and prefixes are achived through
keymaps. Arguments are achieved through C-u or evil motions/
1-9/registers. chords are by key-chord or its in vim by
default. commands are by command mode in vim or M-x in
emacs. Modifiers are just control alt and shift etc&#x2026; The big
thing that emacs has over vim is provide context to a
function. Working differently depending on where you are is
extremely powerful. Emacs also allows making new mode maps which is
the other big thing that emacs does better. Note keymaps are a
combination of states and prefixes. Vim arguments work better
however C-u is a VERY interesting idea. vim also loses to
major/minor modes as this makes plugins ALOT more modular. Allowing
multiple ways to look at a single file depending on context. I dont
absolutely hate the idea of using a mouse like in acme however I
will mention that the more you use the mouse the more likely you
will keep trying to use it. In that case you end up abandonning the
keyboard for long periods of times making it worse. Pressing escape
to do 60+ keybindings is MUCH more efficent then reaching over to
your mouse for a max of 20 keybinds which are context dependant. It
may however be easier to understand at first.
</p>

<ul class="org-ul">
<li>states (insert or normal)</li>
<li>prefix (emacs C-x or vim C-w)</li>
<li>modes (major/minor modes or file types)</li>
<li>argument (2dd or C-u)</li>
<li>chords (keychord)</li>
<li>commands (M-x or ex-commands)</li>
<li>modifers (C-y or C-S-&lt;backspace&gt;)</li>
<li>context (org mode C-c C-c or <a href="https://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/">this</a>)</li>
<li>mouse (plan 9's acme?)</li>
</ul>
</div>
</div>

<div id="outline-container-org8c75b5f" class="outline-3">
<h3 id="org8c75b5f">Emacs State</h3>
<div class="outline-text-3" id="text-org8c75b5f">
<p>
Yes i want to be able to use emacs because i think its important to
understand different ways of doing things. Because of this I am
going to make it a 66% on startup of whether evil mode is enabled
or not. <a href="http://www.elmindreda.org/emacs.html">This is nice if I forget keybinds</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orga0bea17"><span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:states</span> '<span style="color: #B58DAE;">(</span>emacs<span style="color: #B58DAE;">)</span>
 <span style="color: #A2BF8A;">"M-x"</span> 'helm-M-x
 <span style="color: #A2BF8A;">"C-x C-f"</span> 'helm-find-files
 <span style="color: #A2BF8A;">"C-x f"</span> 'helm-locate
 <span style="color: #A2BF8A;">"C-x C-b"</span> 'helm-buffers-list
 <span style="color: #A2BF8A;">"C-x b"</span> 'helm-multi-files
 <span style="color: #A2BF8A;">"C-x g"</span> 'magit-status
 <span style="color: #A2BF8A;">"C-x C-g"</span> 'magit-dispatch
 <span style="color: #A2BF8A;">"C-x C-o"</span> 'other-window
 <span style="color: #A2BF8A;">"C-x C-k"</span> 'kill-this-buffer
 <span style="color: #A2BF8A;">"C-x v"</span> 'revert-buffer
 <span style="color: #A2BF8A;">"C-x t"</span> 'my/eshell-toggle
 <span style="color: #A2BF8A;">"C-x C-t"</span> 'my/vterm-toggle
 <span style="color: #A2BF8A;">"M-j"</span> 'delete-blank-lines <span style="color: #747474;">;; </span><span style="color: #747474;">@</span><span style="color: #cc9393;">TODO</span><span style="color: #747474;">(renzix): Make this also join the previous line if no blank lines?</span>
 <span style="color: #A2BF8A;">"C-o"</span> 'my/smart-open-line
 <span style="color: #A2BF8A;">"C-\\"</span> 'er/expand-region
 <span style="color: #A2BF8A;">"C-."</span> 'repeat
 <span style="color: #A2BF8A;">"&lt;escape&gt;"</span> 'god-local-mode
 <span style="color: #A2BF8A;">"C-="</span> 'my/smart-indent
 <span style="color: #A2BF8A;">"C-j"</span> 'avy-goto-char-2
 <span style="color: #A2BF8A;">"C-'"</span> 'my/helm-projectile-find-file-or-find-file
 <span style="color: #A2BF8A;">"M-'"</span> 'my/helm-projectile-find-file-or-project
 <span style="color: #A2BF8A;">"M-\""</span> 'my/helm-projectile-search-or-project
 <span style="color: #A2BF8A;">"C-\""</span> 'helm-occur
 <span style="color: #A2BF8A;">"C-|"</span> 'helm-mini
 <span style="color: #A2BF8A;">"C-:"</span> 'helm-bookmarks
 <span style="color: #A2BF8A;">"M-p"</span> 'projectile-command-map
 <span style="color: #A2BF8A;">"M-m"</span> 'evilmi-jump-items
 <span style="color: #A2BF8A;">"C-c h"</span> 'helm-command-prefix
 <span style="color: #A2BF8A;">"C-a"</span> 'my/move-beginning-of-line<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
