docs/index.org
** Normal/Visual State

General evil overided global keybinds. 

#+name: keybinds-normal
#+begin_src emacs-lisp
  (general-define-key
   :states '(normal visual)
   "|" 'helm-mini
   "SPC" 'helm-imenu
   ;; "_" 'my/evil-jump-backward
   "s" 'my/eshell-toggle
   "S" 'my/helm-projectile-find-file-or-find-file
   ";" 'helm-M-x
   "g c c" 'comment-line
   "g c r" 'comment-or-uncomment-region
   "g =" 'my/smart-indent
   "g r" 'revert-buffer
   "g p" 'projectile-command-map
   "\\" 'my/helm-projectile-search-or-project
   "U" 'undo-tree-visualize
   "Q" 'save-buffers-kill-terminal
   ", , c" 'org-capture
   ", , l" 'org-store-link
   (general-chord ";;") 'eval-expression
   (general-chord "SS") 'my/helm-projectile-find-file-or-project
   (general-chord "ss") 'my/vterm-toggle
   (general-chord "``") 'magit-status)
#+end_src

** Insert State

These are my keys for insert mode. They should be specifically
about entering or deleting text.

#+name: keybinds-insert
#+begin_src emacs-lisp
  (general-define-key
   :states '(insert)
   (general-chord "uu") 'my/evil-insert-delete-back-word)
#+end_src

** Ex commands

The rest is my ex commands. These are things that are pretty
useful but do not require much context.

#+name: ex-commands
#+begin_src emacs-lisp
  (evil-ex-define-cmd "cfg" 'my/open-emacs-config)
  (evil-ex-define-cmd "a[genda]" 'org-agenda)
  (evil-ex-define-cmd "q[uit]" 'delete-window)
  (evil-ex-define-cmd "bd" 'kill-this-buffer)
#+end_src

** Major Modes
*** Plain Text
**** Org mode

The keybinds for org-mode.

#+name: keybinds-org
#+begin_src emacs-lisp
  (general-define-key
   :keymaps 'org-mode-map
   :states '(normal visual)
   "SPC" 'helm-org-rifle
   "RET" 'org-ctrl-c-ctrl-c
   ", <" 'outline-demote
   ", >" 'outline-promote
   ", p" 'org-up-element
   ", n" 'org-down-element
   ", t" 'org-todo
   ", l" 'org-insert-link
   ", ." 'org-time-stamp
   ", s" 'org-schedule
   ", d" 'org-deadline
   ", e" 'org-export-dispatch
   ", [" 'org-agenda-file-to-front
   ", ]" 'org-remove-file
   ", '" 'org-edit-special
   ", a" 'org-add-note)
  (general-define-key
   :keymaps 'org-mode-map
   :states 'emacs
   "C-c r" 'helm-org-rifle)
#+end_src

**** TODO Org src mode
**** SOMEDAY latex mode
TeX-command-master
**** SOMEDAY markdown mode
*** Programming
**** NEXT csharp mode
**** TODO rustic mode
**** SOMEDAY c/cpp mode
**** SOMEDAY haskell mode
**** SOMEDAY java mode
**** SOMEDAY scala mode
**** SOMEDAY kotlin mode
**** SOMEDAY clojure mode
**** SOMEDAY powershell mode
**** SOMEDAY shell mode
**** SOMEDAY golang mode
**** SOMEDAY dart mode
**** SOMEDAY emacs lisp mode
**** SOMEDAY common lisp mode
**** SOMEDAY perl6 mode
*** Messaging
**** SOMEDAY matrix mode
**** SOMEDAY irc mode
*** Other
**** SOMEDAY magit
** Other
*** Helm

I have been doing helm wrong my whole life. Here is my attempt at
making some of the keybinds a bit better with doing stuff like
ag and switching between helm modes.

#+name: keybinds-helm
#+begin_src emacs-lisp
  (general-define-key
   :keymaps 'helm-find-files-map
   "C-'" 'my/helm-projectile-from-find-files
   "C-s" 'helm-ff-run-grep-ag)
  (general-define-key
   :keymaps 'helm-projectile-find-file-map
   "C-'" 'my/helm-goto-find-files)
  (general-define-key
   :keymaps 'helm-rg-map
   "M-'" 'my/helm-goto-helm-occur)
  (general-define-key
   :keymaps 'helm-occur-map
   "M-'" 'my/helm-goto-helm-rg)
#+end_src
