docs/index.html

<div id="outline-container-orgad86bb8" class="outline-3">
<h3 id="orgad86bb8">Normal/Visual State</h3>
<div class="outline-text-3" id="text-orgad86bb8">
<p>
General evil overided global keybinds. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd63492c"><span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:states</span> '<span style="color: #B58DAE;">(</span>normal visual<span style="color: #B58DAE;">)</span>
 <span style="color: #A2BF8A;">"|"</span> 'helm-mini
 <span style="color: #A2BF8A;">"SPC"</span> 'helm-imenu
 <span style="color: #747474;">;; </span><span style="color: #747474;">"_" 'my/evil-jump-backward</span>
 <span style="color: #A2BF8A;">"s"</span> 'my/eshell-toggle
 <span style="color: #A2BF8A;">"S"</span> 'my/helm-projectile-find-file-or-find-file
 <span style="color: #A2BF8A;">";"</span> 'helm-M-x
 <span style="color: #A2BF8A;">"g c c"</span> 'comment-line
 <span style="color: #A2BF8A;">"g c r"</span> 'comment-or-uncomment-region
 <span style="color: #A2BF8A;">"g ="</span> 'my/smart-indent
 <span style="color: #A2BF8A;">"g r"</span> 'revert-buffer
 <span style="color: #A2BF8A;">"g p"</span> 'projectile-command-map
 <span style="color: #A2BF8A;">"\\"</span> 'my/helm-projectile-search-or-project
 <span style="color: #A2BF8A;">"U"</span> 'undo-tree-visualize
 <span style="color: #A2BF8A;">"Q"</span> 'save-buffers-kill-terminal
 <span style="color: #A2BF8A;">", , c"</span> 'org-capture
 <span style="color: #A2BF8A;">", , l"</span> 'org-store-link
 <span style="color: #B58DAE;">(</span>general-chord <span style="color: #A2BF8A;">";;"</span><span style="color: #B58DAE;">)</span> 'eval-expression
 <span style="color: #B58DAE;">(</span>general-chord <span style="color: #A2BF8A;">"SS"</span><span style="color: #B58DAE;">)</span> 'my/helm-projectile-find-file-or-project
 <span style="color: #B58DAE;">(</span>general-chord <span style="color: #A2BF8A;">"ss"</span><span style="color: #B58DAE;">)</span> 'my/vterm-toggle
 <span style="color: #B58DAE;">(</span>general-chord <span style="color: #A2BF8A;">"``"</span><span style="color: #B58DAE;">)</span> 'magit-status<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e17438" class="outline-3">
<h3 id="org3e17438">Insert State</h3>
<div class="outline-text-3" id="text-org3e17438">
<p>
These are my keys for insert mode. They should be specifically
about entering or deleting text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgb20ae8c"><span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:states</span> '<span style="color: #B58DAE;">(</span>insert<span style="color: #B58DAE;">)</span>
 <span style="color: #B58DAE;">(</span>general-chord <span style="color: #A2BF8A;">"uu"</span><span style="color: #B58DAE;">)</span> 'my/evil-insert-delete-back-word<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bf0531" class="outline-3">
<h3 id="org0bf0531">Ex commands</h3>
<div class="outline-text-3" id="text-org0bf0531">
<p>
The rest is my ex commands. These are things that are pretty
useful but do not require much context.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge759de1"><span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">evil-ex-define-cmd</span> <span style="color: #A2BF8A;">"cfg"</span> 'my/open-emacs-config<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">evil-ex-define-cmd</span> <span style="color: #A2BF8A;">"a[genda]"</span> 'org-agenda<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">evil-ex-define-cmd</span> <span style="color: #A2BF8A;">"q[uit]"</span> 'delete-window<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">evil-ex-define-cmd</span> <span style="color: #A2BF8A;">"bd"</span> 'kill-this-buffer<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d9940a" class="outline-3">
<h3 id="org9d9940a">Major Modes</h3>
<div class="outline-text-3" id="text-org9d9940a">
</div>
<div id="outline-container-org56fc106" class="outline-4">
<h4 id="org56fc106">Plain Text</h4>
<div class="outline-text-4" id="text-org56fc106">
</div>
<ul class="org-ul">
<li><a id="orgb36e3e6"></a>Org mode<br />
<div class="outline-text-5" id="text-orgb36e3e6">
<p>
The keybinds for org-mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org0aed201"><span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:keymaps</span> 'org-mode-map
 <span style="color: #8EBCBB;">:states</span> '<span style="color: #B58DAE;">(</span>normal visual<span style="color: #B58DAE;">)</span>
 <span style="color: #A2BF8A;">"SPC"</span> 'helm-org-rifle
 <span style="color: #A2BF8A;">"RET"</span> 'org-ctrl-c-ctrl-c
 <span style="color: #A2BF8A;">", &lt;"</span> 'outline-demote
 <span style="color: #A2BF8A;">", &gt;"</span> 'outline-promote
 <span style="color: #A2BF8A;">", p"</span> 'org-up-element
 <span style="color: #A2BF8A;">", n"</span> 'org-down-element
 <span style="color: #A2BF8A;">", t"</span> 'org-todo
 <span style="color: #A2BF8A;">", l"</span> 'org-insert-link
 <span style="color: #A2BF8A;">", ."</span> 'org-time-stamp
 <span style="color: #A2BF8A;">", s"</span> 'org-schedule
 <span style="color: #A2BF8A;">", d"</span> 'org-deadline
 <span style="color: #A2BF8A;">", e"</span> 'org-export-dispatch
 <span style="color: #A2BF8A;">", ["</span> 'org-agenda-file-to-front
 <span style="color: #A2BF8A;">", ]"</span> 'org-remove-file
 <span style="color: #A2BF8A;">", '"</span> 'org-edit-special
 <span style="color: #A2BF8A;">", a"</span> 'org-add-note<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:keymaps</span> 'org-mode-map
 <span style="color: #8EBCBB;">:states</span> 'emacs
 <span style="color: #A2BF8A;">"C-c r"</span> 'helm-org-rifle<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9cfb38f"></a><span class="todo TODO">TODO</span> Org src mode<br /></li>
<li><a id="org1ff6275"></a><span class="todo SOMEDAY">SOMEDAY</span> latex mode<br />
<div class="outline-text-5" id="text-org1ff6275">
<p>
TeX-command-master
</p>
</div>
</li>
<li><a id="org6d27e4e"></a><span class="todo SOMEDAY">SOMEDAY</span> markdown mode<br /></li>
</ul>
</div>
<div id="outline-container-org5a8d960" class="outline-4">
<h4 id="org5a8d960">Programming</h4>
<div class="outline-text-4" id="text-org5a8d960">
</div>
<ul class="org-ul">
<li><a id="orgac50996"></a><span class="todo NEXT">NEXT</span> csharp mode<br /></li>
<li><a id="org1d746be"></a><span class="todo TODO">TODO</span> rustic mode<br /></li>
<li><a id="orgd78e876"></a><span class="todo SOMEDAY">SOMEDAY</span> c/cpp mode<br /></li>
<li><a id="org19133b9"></a><span class="todo SOMEDAY">SOMEDAY</span> haskell mode<br /></li>
<li><a id="org143b7d1"></a><span class="todo SOMEDAY">SOMEDAY</span> java mode<br /></li>
<li><a id="orgafca8b2"></a><span class="todo SOMEDAY">SOMEDAY</span> scala mode<br /></li>
<li><a id="orgb9d91c2"></a><span class="todo SOMEDAY">SOMEDAY</span> kotlin mode<br /></li>
<li><a id="org0676f95"></a><span class="todo SOMEDAY">SOMEDAY</span> clojure mode<br /></li>
<li><a id="orgade51b3"></a><span class="todo SOMEDAY">SOMEDAY</span> powershell mode<br /></li>
<li><a id="orga34c18b"></a><span class="todo SOMEDAY">SOMEDAY</span> shell mode<br /></li>
<li><a id="orgf316adb"></a><span class="todo SOMEDAY">SOMEDAY</span> golang mode<br /></li>
<li><a id="org451a559"></a><span class="todo SOMEDAY">SOMEDAY</span> dart mode<br /></li>
<li><a id="orga6304b3"></a><span class="todo SOMEDAY">SOMEDAY</span> emacs lisp mode<br /></li>
<li><a id="org796fd3d"></a><span class="todo SOMEDAY">SOMEDAY</span> common lisp mode<br /></li>
<li><a id="orgfd0abeb"></a><span class="todo SOMEDAY">SOMEDAY</span> perl6 mode<br /></li>
</ul>
</div>
<div id="outline-container-org7d6a87d" class="outline-4">
<h4 id="org7d6a87d">Messaging</h4>
<div class="outline-text-4" id="text-org7d6a87d">
</div>
<ul class="org-ul">
<li><a id="org7181bc4"></a><span class="todo SOMEDAY">SOMEDAY</span> matrix mode<br /></li>
<li><a id="orgb513265"></a><span class="todo SOMEDAY">SOMEDAY</span> irc mode<br /></li>
</ul>
</div>
<div id="outline-container-orgd9a6789" class="outline-4">
<h4 id="orgd9a6789">Other</h4>
<div class="outline-text-4" id="text-orgd9a6789">
</div>
<ul class="org-ul">
<li><a id="orgf2ae105"></a><span class="todo SOMEDAY">SOMEDAY</span> magit<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org992447d" class="outline-3">
<h3 id="org992447d">Other</h3>
<div class="outline-text-3" id="text-org992447d">
</div>
<div id="outline-container-org99cf1fa" class="outline-4">
<h4 id="org99cf1fa">Helm</h4>
<div class="outline-text-4" id="text-org99cf1fa">
<p>
I have been doing helm wrong my whole life. Here is my attempt at
making some of the keybinds a bit better with doing stuff like
ag and switching between helm modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org2234239"><span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:keymaps</span> 'helm-find-files-map
 <span style="color: #A2BF8A;">"C-'"</span> 'my/helm-projectile-from-find-files
 <span style="color: #A2BF8A;">"C-s"</span> 'helm-ff-run-grep-ag<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:keymaps</span> 'helm-projectile-find-file-map
 <span style="color: #A2BF8A;">"C-'"</span> 'my/helm-goto-find-files<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:keymaps</span> 'helm-rg-map
 <span style="color: #A2BF8A;">"M-'"</span> 'my/helm-goto-helm-occur<span style="color: #80A0C2;">)</span>
<span style="color: #80A0C2;">(</span>general-define-key
 <span style="color: #8EBCBB;">:keymaps</span> 'helm-occur-map
 <span style="color: #A2BF8A;">"M-'"</span> 'my/helm-goto-helm-rg<span style="color: #80A0C2;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel DeBruno (Renzix)</p>
<p class="date">Created: 2019-09-02 Mon 00:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
